{
  "schema_version": "1.0.0",
  "command": "fsck.ext4",
  "description": "e2fsck - check a Linux ext2/ext3/ext4 file system",
  "global_flags": [
    {
      "short": "-B",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "e2fsck will search for the superblock at various dif‐ ferent block sizes in an attempt to find the  appropriate  block size.   This  search  can  be fooled in some cases.  This option forces e2fsck to only try locating the superblock at a  particu‐ lar blocksize.  If the superblock is not found, e2fsck will ter‐ minate with a fatal error.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-C",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This option causes e2fsck to write completion information to the specified file descriptor so that the progress of the file  sys‐ tem  check  can  be monitored.  This option is typically used by programs which are running e2fsck.  If the file descriptor  num‐ ber is negative, then absolute value of the file descriptor will be  used,  and  the progress information will be suppressed ini‐ tially.  It can later be enabled by sending the e2fsck process a SIGUSR1 signal.  If the file descriptor specified is  0,  e2fsck will print a completion bar as it goes about its business.  This requires that e2fsck is running on a video console or terminal.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Optimize directories in file system.  This option causes  e2fsck to  try  to optimize all directories, either by re-indexing them if the file system supports directory indexing,  or  by  sorting and compressing directories for smaller directories, or for file systems using traditional linear directories.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "e2fsck  extended options.  Extended options are comma sepa‐ rated, and may take an argument using  the  equals  ('=')  sign. The following options are supported:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Flush the file system device's buffer caches  before  beginning. Only really useful for doing e2fsck time trials.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "blocks  specified  by filename.  (This option is the same as the -l option, except the bad  blocks list is cleared before the blocks listed in the file are added to the bad blocks list.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Print version information and exit.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-a",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This option does the same thing as the -p option.   It  is  pro‐ vided  for  backwards  compatibility  only; it is suggested that people use -p option whenever possible.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "alternative  su‐ perblock  specified by superblock.  This option is normally used when the primary superblock has been corrupted.  The location of backup superblocks is dependent on the file system's  blocksize, the  number of blocks per group, and features such as sparse_su‐ per.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This  option  causes  e2fsck to use badblocks(8) program to do a read-only scan of the device in order to find  any  bad  blocks. If any bad blocks are found, they are added to the bad block in‐ ode to prevent them from being allocated to a file or directory. If  this option is specified twice, then the bad block scan will be done using a non-destructive read-write test.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Print   debugging  output  (useless  unless  you  are  debugging e2fsck).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-f",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Force checking even if the file system seems clean.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-j",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Set location of the external journal",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-k",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "When combined with the -c option, any existing bad blocks in the bad  blocks  list are preserved, and any new bad blocks found by running badblocks(8) will be added to the  existing  bad  blocks list.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-l",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  block numbers listed in the file specified by filename to the list of bad blocks.  The format of this file is the  same as the one generated by the badblocks(8) program.  Note that the block  numbers  are  based  on the blocksize of the file system. Hence, badblocks(8) must be given the blocksize of the file sys‐ tem in order to obtain correct results.  As a result, it is much simpler and safer to use the -c option to e2fsck, since it  will assure  that  the correct parameters are passed to the badblocks program.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Open the file system read-only, and assume an answer of `no'  to all  questions.   Allows  e2fsck  to  be used non-interactively. This option may not be specified at the same time as the  -p  or",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Automatically  repair  (\"preen\")  the  file system.  This option will cause e2fsck to automatically fix any file system  problems that  can be safely fixed without human intervention.  If e2fsck discovers a problem which may require the  system  administrator to  take  additional  corrective action, e2fsck will print a de‐ scription of the problem and then exit with the  value  4  logi‐ cally  or'ed  into  the exit code.  (See the EXIT CODE section.) This option is normally used by the system's boot  scripts.   It may not be specified at the same time as the -n or -y options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This  option  does nothing at all; it is provided only for back‐ wards compatibility.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Print timing statistics for e2fsck.   If  this  option  is  used twice,  additional  timing  statistics  are printed on a pass by pass basis.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Verbose mode.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-y",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Assume \"yes\" to all questions",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "overwriting  a file system block, write the old contents of the block to an undo file.  This undo file can be  used  with e2undo(8)  to restore the old contents of the file system should something go wrong.  If  the  empty  string  is  passed  as  the undo_file  argument,  the  undo  file  will be written to a file named e2fsck-device.e2undo in the directory  specified  via  the E2FSPROGS_UNDO_DIR environment variable.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [],
  "positional": [
    {
      "name": "device",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "tions",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 0.9,
  "version": null
}