{
  "schema_version": "1.0.0",
  "command": "hdparm",
  "description": "hdparm - get/set SATA/IDE device parameters",
  "global_flags": [
    {
      "short": null,
      "long": "--Iraw",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Write raw binary identify data to the specfied file",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--Istdin",
      "value_type": "File",
      "takes_value": true,
      "description": "is  a  special  variation  on  the  -I  option, which accepts a drive identification block as standard input instead of using a /dev/hd* parameter.  The format of this block must be exactly the same as that found in the /proc/ide/*/hd*/identify \"files\", or that produced by the --Istdout option described below.  This variation is designed for use with collected \"libraries\" of drive identifica‐ tion information, and can also be used on ATAPI drives which may give media errors with the standard  mechanism.   When  --Istdin  is used,  it  must be the *only* parameter given.  Note that some information will be incomplete, as the drive LOG PAGES are unavailable when --Istdin is used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--Istdout",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Write identify data to stdout as ASCII hex",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--dco-freeze",
      "value_type": "String",
      "takes_value": true,
      "description": "stands for Device Configuration Overlay, a way for vendors to selectively disable certain features of a drive.  The --dco-freeze option will freeze/lock the current drive configuration, thereby preventing software (or malware) from changing any DCO settings  un‐ til after the next power-on reset.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--dco-identify",
      "value_type": "String",
      "takes_value": true,
      "description": "and  dump information regarding drive configuration settings which can be disabled by the vendor or OEM installer.  These set‐ tings show capabilities of the drive which might be disabled by the vendor for \"enhanced compatibility\".   When  disabled,  they  are otherwise  hidden  and  will  not show in the -I identify output.  For example, system vendors sometimes disable 48_bit addressing on large drives, for compatibility (and loss of capacity) with a specific BIOS.  In such cases, --dco-identify will show that the  drive is 48_bit capable, but -I will not show it, and nor will the drive accept 48_bit commands.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--dco-restore",
      "value_type": "String",
      "takes_value": true,
      "description": "This command will fail if  DCO  is  frozen/locked, or if a -Np maximum size restriction has also been set.  This is EXTREMELY DANGEROUS and will very likely cause massive loss of data.  DO NOT USE THIS COMMAND.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--dco-setmax",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Use DCO to set maximum addressable sectors",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": "--direct",
      "value_type": "File",
      "takes_value": true,
      "description": "Perform timings of device reads for benchmark and comparison purposes. For meaningful results, this operation should be repeated 2–3 times on an otherwise inactive system (no other active processes) with at least a couple of megabytes of free memory. This displays the speed of reading through the buffer cache to the disk without any prior caching of data. This measurement is an indication of how fast the drive can sustain sequential data reads under Linux, without any filesystem overhead. To ensure accurate measurements, the buffer cache is flushed during the processing of -t using the BLKFLSBUF ioctl.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--drq-hsm-error",
      "value_type": "String",
      "takes_value": true,
      "description": "This option causes hdparm to issue an IDENTIFY command to the  kernel,  but  incor‐ rectly  marked  as a \"non-data\" command.  This results in the drive being left with its DataReQust(DRQ) line \"stuck\" high.  This con‐ fuses the kernel drivers, and may crash the system immediately with massive data loss.  The option exists to help in testing and for‐ tifying the kernel against similar real-world drive malfunctions.  VERY DANGEROUS, DO NOT USE!!",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fallocate",
      "value_type": "Bool",
      "takes_value": false,
      "description": "When used, this must be the only option given.  It  requires  two parameters: the desired file size in kibibytes (byte count divided by 1024), followed by the pathname for the new file.  It will cre‐ ate  a  new  file of the specified size, but without actually having to write any data to the file.  This will normally complete very quickly, and without thrashing the storage device.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fibmap",
      "value_type": "File",
      "takes_value": true,
      "description": "It requires a file path as a parameter, and will print out a list of  the  block  ex‐ tents  (sector  ranges) occupied by that file on disk.  Sector numbers are given as absolute LBA numbers, referenced from sector 0 of the physical device rather than from the partition or filesystem.  This information can then be used for a variety of purposes,  such as examining the degree of fragmentation of larger files, or determining appropriate sectors to deliberately corrupt during fault-in‐ jection testing procedures.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload",
      "value_type": "File",
      "takes_value": true,
      "description": "It requires a file path immediately after the  option,  indicating  where  the  new drive firmware should be read from.  The contents of this file will be sent to the drive using the (S)ATA DOWNLOAD MICROCODE command, using either transfer protocol 7 (entire file at once), or, if the drive supports it, transfer protocol 3 (segmented download).  This command is EXTREMELY DANGEROUS and could destroy both the drive and all data on it.  DO NOT USE THIS COMMAND.  The --fwdownload-mode3 ,  --fwdownload-mode3-max  , and --fwdownload-mode7 variations on basic --fwdownload allow overriding automatic protocol detection in favour of forcing hdparm to use a specific transfer protocol, for testing purposes only.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload-mode3",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Download firmware using min-size segments (EXTREMELY DANGEROUS)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload-mode3-max",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Download firmware using max-size segments (EXTREMELY DANGEROUS)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload-mode7",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Download firmware using a single segment (EXTREMELY DANGEROUS)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload-modee",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Download firmware using mode E (min-size segments) (EXTREMELY DANGEROUS)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fwdownload-modee-max",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Download firmware using mode E (max-size segments) (EXTREMELY DANGEROUS)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--idle-immediate",
      "value_type": "String",
      "takes_value": true,
      "description": "Usually the device remains spun-up.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--idle-unload",
      "value_type": "String",
      "takes_value": true,
      "description": "Usually the device remains spun-up.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--make-bad-sector",
      "value_type": "Number",
      "takes_value": true,
      "description": "EXCEPTIONALLY DANGEROUS. DO NOT USE THIS OPTION!!   This  can  be useful  for  testing  of device/RAID error recovery mechanisms.  The sector number is given as a (base10) parameter after the option. Depending on the device, hdparm will choose one of two possible ATA commands for corrupting the sector.  The WRITE_LONG works on most drives, but only up to the 28-bit sector boundary.  Some very recent drives (2008) may support the new  WRITE_UNCORRECTABLE_EXT  com‐ mand, which works for any LBA48 sector.  If available, hdparm will use that in preference to WRITE_LONG.  The WRITE_UNCORRECTABLE_EXT command  itself  presents  a choice of how the new bad sector should behave.  By default, it will look like any other bad sector, and the drive may take some time to retry and fail on subsequent READs of the sector.  However, if a single letter f is prepended immedi‐ ately in front of the first digit of the sector number parameter, then hdparm will issue a \"flagged\"  WRITE_UNCORRECTABLE_EXT,  which causes  the  drive  to merely flag the sector as bad (rather than genuinely corrupt it), and subsequent READs of the sector will fail immediately (rather than after several retries).  Note also that the --repair-sector option can be used to restore (any) bad  sectors when  they  are no longer needed, including sectors that were genuinely bad (the drive will likely remap those to a fresh area on the media).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--offset",
      "value_type": "Bool",
      "takes_value": false,
      "description": "use with -t, to begin timings at given offset (in GiB) from start of drive",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--prefer-ata12",
      "value_type": "String",
      "takes_value": true,
      "description": "But some  USB  drive  enclosures don't work correctly with 16-byte commands.  This option can be used to force use of the smaller 12-byte command format with such drives.  hdparm will still revert to 16-byte commands for things that cannot be done with the 12-byte format (e.g., sector accesses beyond 28-bits).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--read-sector",
      "value_type": "Bool",
      "takes_value": false,
      "description": "from  the specified sector number, and dumps the contents in hex to standard output.  The sector number must be given (base10) after this option.  hdparm will issue a low-level read (completely bypassing the usual block layer  read/write  mechanisms)  for  the specified  sector.   This  can be used to definitively check whether a given sector is bad (media error) or not (doing so through the usual mechanisms can sometimes give false positives).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--repair-sector",
      "value_type": "String",
      "takes_value": true,
      "description": "VERY DANGEROUS.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-antifreeze-lock",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Block sanitize-freeze-lock command until next power cycle",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-block-erase",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Start block erase operation",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-crypto-scramble",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Change the internal encryption keys that used for used data",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-freeze-lock",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Lock drive's sanitize features until next power cycle",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-overwrite",
      "value_type": "String",
      "takes_value": true,
      "description": "PATTERN Overwrite the internal media with constant PATTERN",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-overwrite-passes",
      "value_type": "Number",
      "takes_value": true,
      "description": "Number of overwrite passes from 0 to 7, default 0 means 16 passes",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sanitize-status",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Show sanitize status information",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-disable",
      "value_type": "String",
      "takes_value": true,
      "description": "Password is given as an ASCII string and is padded with NULs to reach 32 bytes.  The  ap‐ plicable  drive  password  is selected with the --user-master switch (default is \"user\" password).  No other options are permitted on the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-erase",
      "value_type": "String",
      "takes_value": true,
      "description": "Password is given as an ASCII string and is  padded  with  NULs  to  reach  32 bytes.  Use the special password NULL to represent an empty password.  The applicable drive password is selected with the --user-mas‐ ter switch (default is \"user\" password).  No other options are permitted on the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-erase-enhanced",
      "value_type": "String",
      "takes_value": true,
      "description": "Password is given as an ASCII string and is padded with NULs to reach 32  bytes.   The  applicable drive password is selected with the --user-master switch (default is \"user\" password).  No other options are permitted on the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-freeze",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the drive's security settings.  The drive does not accept any security commands until next power-on reset.  Use this function in combination with --security-unlock to protect drive from any attempt to set a new password. Can be used standalone, too.  No other options are permitted on the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-help",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display help for ATA security commands",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-mode",
      "value_type": "String",
      "takes_value": true,
      "description": "Defaults to high.  Only useful in combination with --security-set-pass. h       high security m       maximum security",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-prompt-for-password",
      "value_type": "String",
      "takes_value": true,
      "description": "This avoids having passwords show up in shell  history or in /proc/self/cmdline during execution.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-set-pass",
      "value_type": "String",
      "takes_value": true,
      "description": "Password is given as an ASCII string and is padded with NULs to reach 32  bytes.  Use the special password NULL to set an empty password.  The applicable drive password is selected with the --user-master switch (default is \"user\" password) and the applicable security mode with the --security-mode switch.  No other options are permitted on the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--security-unlock",
      "value_type": "String",
      "takes_value": true,
      "description": "the drive, using password PWD.  Password is given as an ASCII string and is padded with NULs to reach 32 bytes.  The applica‐ ble drive password is selected with the --user-master switch (default is \"user\" password).  No other options  are  permitted  on  the command line with this one.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--set-sector-size",
      "value_type": "String",
      "takes_value": true,
      "description": "sector  size  in bytes.  VERY DANGEROUS. This most likely will scramble all data on the drive.  The specified size must be one of 512, 520, 528, 4096, 4160, or 4224.  Very few drives support values other than 512 and 4096.  Eg.  hdparm --set-sector-size 4096 /dev/sdb",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--trim-sector-ranges",
      "value_type": "Number",
      "takes_value": true,
      "description": "Solid State Drives (SSDs).  EXCEPTIONALLY DANGEROUS. DO NOT USE THIS OPTION!!  Tells the drive firmware to discard unneeded data sectors, destroying any data that may have been present within them.  This makes those sectors available for  immediate  use  by  the firmware's garbage collection mechanism, to improve scheduling for wear-leveling of the flash media.  This option expects one or more sector  range pairs immediately after the option: an LBA starting address, a colon, and a sector count (max 65535), with no interven‐ ing spaces.  EXCEPTIONALLY DANGEROUS. DO NOT USE THIS OPTION!!",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--trim-sector-ranges-stdin",
      "value_type": "Bool",
      "takes_value": false,
      "description": "being  specified  on  the command  line.  This can be used to avoid problems with excessively long command lines.  It also permits batching of many more sector ranges into single commands to the drive, up to the currently configured transfer limit (max_sectors_kb).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--user-master",
      "value_type": "String",
      "takes_value": true,
      "description": "Defaults to user password.  Only useful  in  combination  with  --security-unlock,",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--verbose",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display extra diagnostics from some commands",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--write-sector",
      "value_type": "Number",
      "takes_value": true,
      "description": "VERY DANGEROUS.  The sector number must be given (base10) after  this  option.   hdparm will issue a low-level write (completely bypassing the usual block layer read/write mechanisms) to the specified sector.  This can be used to force a drive to repair a bad sector (media error).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-A",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get/set the IDE drive's read-lookahead feature (usually ON by default).  Usage: -A0 (disable) or -A1 (enable).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-B",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set  Advanced  Power Management feature, if the drive supports it. A low value means aggressive power management and a high value means better performance.  Possible settings range from values 1 through 127 (which permit spin-down), and  values  128  through  254 (which do not permit spin-down).  The highest degree of power management is attained with a setting of 1, and the highest I/O perfor‐ mance  with a setting of 254.  A value of 255 tells hdparm to disable Advanced Power Management altogether on the drive (not all dri‐ ves support disabling it, but most do).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-C",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Check the current IDE power mode status, which will always be one of unknown (drive does not support this command), active/idle (nor‐ mal  operation),  standby (low power mode, drive has spun down), or sleeping (lowest power mode, drive is completely shut down).  The",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Enable/disable the on-drive defect management feature, whereby the drive firmware tries to automatically manage defective sectors  by relocating  them to \"spare\" sectors reserved by the factory for such.  Control of this feature via the -D option is not supported for most modern drives since ATA-4; thus this command may fail.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": null,
      "value_type": "Number",
      "takes_value": true,
      "description": "Set cd/dvd drive speed.  This is NOT necessary for regular operation, as the drive will automatically switch speeds on its own.   But if  you  want to play with it, just supply a speed number after the option, usually a number like 2 or 4.  This can be useful in some cases, though, to smooth out DVD video playback.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Flush the on-drive write cache buffer (older drives may not implement this).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-H",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Read  the  temperature  from some (mostly Hitachi) drives.  Also reports if the temperature is within operating condition range (this may not be reliable). Does not cause the drive to spin up if idle.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Request identification info directly from the drive, which is displayed in a new expanded format with considerably more  detail  than with the older -i option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-J",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get/set the Western Digital (WD) Green Drive's \"idle3\" timeout value.  This timeout controls how often the drive parks its heads  and enters  a  low  power  consumption  state.  The factory default is eight (8) seconds, which is a very poor choice for use with Linux. Leaving it at the default will result in hundreds of thousands of head load/unload cycles in a very short period of time.  The  drive mechanism  is only rated for 300,000 to 1,000,000 cycles, so leaving it at the default could result in premature failure, not to men‐ tion the performance impact of the drive often having to wake-up before doing routine I/O.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-K",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Set the drive's \"keep_features_over_reset\" flag.  Setting this enables the drive to retain the settings for -APSWXZ over a soft reset (as done during the error recovery sequence).  Not all drives support this feature.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Set the drive's doorlock flag.  Setting this to 1 will lock the door mechanism of some removable hard  drives  (e.g.,  Syquest,  ZIP, Jazz..), and setting it to 0 will unlock the door mechanism.  Normally, Linux maintains the door locking mechanism automatically, de‐ pending  on drive usage (locked whenever a filesystem is mounted).  But on system shutdown, this can be a nuisance if the root parti‐ tion is on a removable disk, since the root partition is left mounted (read-only) after shutdown.  So, by using this command  to  un‐ lock the door after the root filesystem is remounted read-only, one can then remove the cartridge from the drive after shutdown.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-M",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get/set Automatic Acoustic Management (AAM) setting. Most modern harddisk drives have the ability to speed down the head movements to reduce their noise output.  The possible values are between 0 and 254. 128 is the most quiet (and therefore slowest) setting and  254 the  fastest  (and  loudest). Some drives have only two levels (quiet / fast), while others may have different levels between 128 and 254.  At the moment, most drives only support 3 options, off, quiet, and fast.  These have been assigned the values 0, 128,  and  254 at present, respectively, but integer space has been incorporated for future expansion, should this change.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-N",
      "long": null,
      "value_type": "Number",
      "takes_value": true,
      "description": "Get/set  max  visible number of sectors, also known as the Host Protected Area setting.  Without a parameter, -N displays the current setting, which is reported as two values: the first gives the current max sectors setting, and the second  shows  the  native  (real) hardware  limit  for  the  disk.  The difference between these two values indicates how many sectors of the disk are currently hidden from the operating system, in the form of a Host Protected Area (HPA).  This area is often used by computer makers to hold diagnostic software, and/or a copy of the originally provided operating system for recovery purposes.  Another possible use is to hide the  true capacity  of a very large disk from a BIOS/system that cannot normally cope with drives of that size (e.g., most current {2010} BIOSs cannot deal with drives larger than 2 TB, so an HPA could be used to cause a 3 TB drive to report itself as a 2 TB drive).  To change the current max (VERY DANGEROUS, DATA LOSS IS EXTREMELY LIKELY), a new value should be provided (in base10) immediately following the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Set the maximum sector count for the drive's internal prefetch mechanism.  Not all drives support this feature, and  it  was  dropped from the official spec as of ATA-4.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Q",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get  or set the device's command queue_depth, if supported by the hardware.  This only works with 2.6.xx (or later) kernels, and only with device and driver combinations which support changing the queue_depth.  For SATA disks, this is the Native Command Queuing (NCQ) queue depth.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-R",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set Write-Read-Verify feature, if the drive supports it.  Usage: -R0 (disable) or -R1 (enable).  This feature is intended to have the drive firmware automatically read-back any data that is written by software, to verify that the data  was  successfully  written. This is generally overkill, and can slow down disk writes by as much as a factor of two (or more).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Set standby (spindown) timeout",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Perform timings of cache reads for benchmark and comparison purposes.  For meaningful results, this operation should be repeated  2–3 times  on an otherwise inactive system (no other active processes) with at least a couple of megabytes of free memory.  This displays the speed of reading directly from the Linux buffer cache without disk access.  This measurement is essentially an indication of  the throughput of the processor, cache, and memory of the system under test.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Obsolete",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display program version and exit immediately.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-W",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set the IDE/SATA drive's write-caching feature.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-X",
      "long": null,
      "value_type": "Number",
      "takes_value": true,
      "description": "Set the IDE transfer mode for (E)IDE/ATA drives.  This is typically used in combination with -d1 when enabling DMA to/from a drive on a  supported  interface chipset, where -X mdma2 is used to select multiword DMA mode2 transfers and -X sdma1 is used to select simple mode 1 DMA transfers.  With systems which support UltraDMA burst timings, -X udma2 is used to select UltraDMA mode2 transfers (you'll need to prepare the chipset for UltraDMA beforehand).  Apart from that, use of this option is seldom necessary since most/all  modern IDE  drives  default  to  their fastest PIO transfer mode at power-on.  Fiddling with this can be both needless and risky.  On drives which support alternate transfer modes, -X can be used to switch the mode of the drive only.  Prior to changing  the  transfer  mode, the  IDE  interface  should  be  jumpered or programmed (see -p option) for the new mode setting to prevent loss and/or corruption of data.  Use this with extreme caution!  For the PIO (Programmed Input/Output) transfer modes used by Linux, this value is  simply  the desired  PIO mode number plus 8.  Thus, a value of 09 sets PIO mode1, 10 enables PIO mode2, and 11 selects PIO mode3.  Setting 00 re‐ stores the drive's \"default\" PIO mode, and 01 disables IORDY.  For multiword DMA, the value used is the desired DMA mode number  plus 32.  for UltraDMA, the value is the desired UltraDMA mode number plus 64.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Y",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Force an IDE drive to immediately enter the lowest power consumption sleep mode, causing it to shut down completely.  A hard or  soft reset  is  required  before  the  drive can be accessed again (the Linux IDE driver will automatically handle issuing a reset if/when needed).  The current power mode status can be checked using the -C option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Disable the automatic power-saving function of certain Seagate drives (ST3xxx models?), to prevent them from idling/spinning-down  at inconvenient times.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-a",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Get/set  sector  count for filesystem (software) read-ahead.  This is used to improve performance in sequential reads of large files, by prefetching additional blocks in anticipation of them being needed by the running task.  Many IDE  drives  also  have  a  separate built-in read-ahead function, which augments this filesystem (software) read-ahead function.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set bus state.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": null,
      "value_type": "Number",
      "takes_value": true,
      "description": "Get/set (E)IDE 32-bit I/O support.  A numeric parameter can be used to enable/disable 32-bit I/O support.  Currently supported values include 0 to disable 32-bit I/O support, 1 to enable 32-bit data transfers, and 3 to enable 32-bit data transfers with a special sync sequence required by many chipsets.  The value 3 works with nearly all 32-bit IDE chipsets, but incurs slightly more overhead.   Note that \"32-bit\" refers to data transfers across a PCI or VLB bus to the interface card only; all (E)IDE drives still have only a 16-bit connection over the ribbon cable from the interface card.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get/set the \"using_dma\" flag for this drive.  This option now works with most combinations of drives and PCI interfaces which support DMA and which are known to the kernel IDE driver.  It is also a good idea to use the appropriate -X option in combination with -d1 to ensure that the drive itself is programmed for the correct DMA mode, although most BIOSs should do this for you at boot time.   Using DMA  nearly  always  gives the best performance, with fast I/O throughput and low CPU usage.  But there are at least a few configura‐ tions of chipsets and drives for which DMA does not make much of a difference, or may even slow things  down  (on  really  messed  up hardware!).  Your mileage may vary.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-f",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Sync and flush the buffer cache for the device on exit.  This operation is also performed internally as part of the -t and -T timings and other options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-g",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display the drive geometry (cylinders, heads, sectors), the size (in sectors) of the device, and the starting offset (in sectors)  of the device from the beginning of the drive.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-h",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display terse usage information (help).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": null,
      "value_type": "Directory",
      "takes_value": true,
      "description": "Display the identification info which the kernel drivers (IDE, libata) have stored from boot/configuration  time.   This  may  differ from  the current information obtainable directly from the drive itself with the -I option.  The data returned may or may not be cur‐ rent, depending on activity since booting the system.  For a more detailed interpretation of the identification info, refer to AT At‐ tachment Interface for Disk Drives, ANSI ASC X3T9.2 working draft, revision 4a, April 19/93, and later editions.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-k",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set  the  \"keep_settings_over_reset\" flag for the drive.  When this flag is set, the drive will preserve the -dmu settings over a soft reset, (as done during the error recovery sequence).  This option defaults to off, to prevent drive reset loops which  could  be caused  by  combinations  of  -dmu settings.  The -k option should therefore only be set after one has achieved confidence in correct system operation with a chosen set of configuration settings.  In practice, all that is typically necessary to test  a  configuration (prior  to  using  -k) is to verify that the drive can be read/written, and that no error logs (kernel messages) are generated in the process (look in /var/log/messages on most systems).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-m",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Get/set  sector  count  for  multiple  sector I/O on the drive.  A setting of 0 disables this feature.  Multiple sector mode (aka IDE Block Mode), is a feature of most modern IDE hard drives, permitting the transfer of multiple sectors per I/O interrupt, rather  than the  usual  one  sector  per interrupt.  When this feature is enabled, it typically reduces operating system overhead for disk I/O by 30–50%.  On many systems, it also provides increased data throughput of anywhere from 5% to 50%.  Some drives, however (most  notably the  WD  Caviar series), seem to run slower with multiple mode enabled.  Your mileage may vary.  Most drives support the minimum set‐ tings of 2, 4, 8, or 16 (sectors).  Larger settings may also be possible, depending on the drive.  A setting of 16 or 32 seems  opti‐ mal  on  many  systems.  Western Digital recommends lower settings of 4 to 8 on many of their drives, due tiny (32 KiB) drive buffers and non-optimized buffering algorithms.  The -i option can be used to find the maximum setting supported by an installed drive  (look for  MaxMultSect  in  the  output).   Some drives claim to support multiple mode, but lose data at some settings.  Under rare circum‐ stances, such failures can result in massive filesystem corruption.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Get or set the \"ignore_write_errors\" flag in the driver.  Do NOT play with this without grokking the driver source code first.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Attempt to reprogram the IDE interface chipset for the specified PIO mode, or attempt to auto-tune for the \"best\" PIO mode  supported by  the  drive.   This feature is supported in the kernel for only a few \"known\" chipsets, and even then the support is iffy at best. Some IDE chipsets are unable to alter the PIO mode for a single drive, in which case this option may cause the PIO mode for both dri‐ ves to be set.  Many IDE chipsets support either fewer or more than the standard six (0 to 5) PIO modes, so the exact  speed  setting that  is actually implemented will vary by chipset/driver sophistication.  Use with extreme caution!  This feature includes zero pro‐ tection for the unwary, and an unsuccessful outcome may result in severe filesystem corruption!",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-q",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Handle the next option quietly, suppressing normal output (but not error messages).  This is useful for reducing screen clutter  when running from system startup scripts.  Not applicable to the -i or -v or -t or -T options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Get/set read-only flag for the device.  When set, Linux disallows write operations on the device.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Enable/disable the power-on in standby feature, if supported by the drive.  VERY DANGEROUS.  Do not use  unless  you  are  absolutely certain that both the system BIOS (or firmware) and the operating system kernel (Linux >= 2.6.22) support probing for drives that use this  feature.  When enabled, the drive is powered-up in the standby mode to allow the controller to sequence the spin-up of devices, reducing the instantaneous current draw burden when many drives share a power supply.  Primarily for use in large RAID setups.   This feature is usually disabled and the drive is powered-up in the active mode (see -C above).  Note that a drive may also allow enabling this  feature  by  a  jumper.   Some  SATA drives support the control of this feature by pin 11 of the SATA power connector. In these cases, this command may be unsupported or may have no effect.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-u",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "Get/set the interrupt-unmask flag for the drive.  A setting of 1 permits the driver to unmask other interrupts during processing of a disk interrupt, which greatly improves Linux's responsiveness and eliminates \"serial port overrun\" errors.   Use  this  feature  with caution:  some  drive/controller  combinations do not tolerate the increased I/O latencies possible when this feature is enabled, re‐ sulting in massive filesystem corruption.  In particular, CMD-640B and RZ1000 (E)IDE interfaces can be unreliable (due to a  hardware flaw)  when  this  option  is  used with kernel versions earlier than 2.0.13.  Disabling the IDE prefetch feature of these interfaces (usually a BIOS/CMOS setting) provides a safe fix for the problem for use with earlier kernels.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Display some basic settings, similar to -acdgkmur for IDE.  This is also the default behaviour when no options are specified.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-w",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Perform a device reset (DANGEROUS).  Do NOT use this option.  It exists for unlikely situations where a reboot might otherwise be re‐ quired to get a confused drive back into a useable state.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-x",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Obsolete",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-y",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Force  an  IDE drive to immediately enter the low power consumption standby mode, usually causing it to spin down.  The current power mode status can be checked using the -C option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Force a kernel re-read of the partition table of the specified device(s).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [],
  "positional": [
    {
      "name": "device",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 0.9,
  "version": "9.65"
}