{
  "schema_version": "1.0.0",
  "command": "less",
  "description": "LESS(1) General Commands Manual LESS(1)",
  "global_flags": [
    {
      "short": "-C",
      "long": "--CLEAR-SCREEN",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-G",
      "long": "--HILITE-SEARCH",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-W",
      "long": "--HILITE-UNREAD",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": "--IGNORE-CASE",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-N",
      "long": "--LINE-NUMBERS",
      "value_type": "String",
      "takes_value": true,
      "description": "The default is 7 characters.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Ofilename",
      "long": "--LOG-FILE",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-M",
      "long": "--LONG-PROMPT",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--MOUSE",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Q",
      "long": "--QUIET",
      "value_type": "String",
      "takes_value": true,
      "description": "If the terminal has a \"visual bell\", it  is  used  in  all  cases where the terminal bell would have been rung.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": "--QUIT-AT-EOF",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-R",
      "long": "--RAW-CONTROL-CHARS",
      "value_type": "File",
      "takes_value": true,
      "description": "-r,  but  only ANSI \"color\" escape sequences and OSC 8 hyperlink sequences are output in \"raw\" form.  Unlike -r, the screen ap‐ pearance is maintained correctly, provided that there are no escape sequences in the file other than these types of escape sequences. Color escape sequences are only supported when the color is changed within one line, not across lines.  In other words, the beginning of each line is assumed to be normal (non-colored), regardless of any escape sequences in previous lines.  For the purpose of keeping track of screen appearance, these escape sequences are assumed to not move the cursor.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-A",
      "long": "--SEARCH-SKIP-SCREEN",
      "value_type": "String",
      "takes_value": true,
      "description": "all forward searches (not just non-repeated searches) to start just after the target line, and all backward searches to start just before the target line.  Thus, forward searches will skip part of the displayed screen (from the first line up to and  including the  target  line).   Similarly  backwards  searches will skip the displayed screen from the last line up to and including the target line.  This was the default behavior in less versions prior to 441.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": "--UNDERLINE-SPECIAL",
      "value_type": "String",
      "takes_value": true,
      "description": "backspaces,  tabs,  carriage returns and \"formatting characters\" (as defined by Unicode) to be treated as control characters; that is, they are handled as specified by the -r option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-B",
      "long": "--auto-buffers",
      "value_type": "String",
      "takes_value": true,
      "description": "If a large amount of data is read from the pipe, this can cause a large amount of memory to be allocated.  The -B option disables  this  automatic  allocation  of  buffers  for pipes, so that only 64 KB (or the amount of space specified by the -b option) is used for the pipe.  Warning: use of -B can result in erroneous display, since only the most recently viewed part of the piped data is kept in memory; any earlier data is lost.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-bn",
      "long": "--buffers",
      "value_type": "File",
      "takes_value": true,
      "description": "By  default  64 KB  of  buffer space  is  used  for  each  file (unless the file is a pipe; see the -B option).  The -b option specifies instead that n kilobytes of buffer space should be used for each file.  If n is -1, buffer space is unlimited; that is, the entire file can be read into memory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": "--chop-long-lines",
      "value_type": "String",
      "takes_value": true,
      "description": "lines  longer  than the screen width to be chopped (truncated) rather than wrapped.  That is, the portion of a long line that does not fit in the screen width is not displayed until you press RIGHT-ARROW.  The default is to wrap long lines; that  is,  display the remainder on the next line.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": "--clear-screen",
      "value_type": "Bool",
      "takes_value": false,
      "description": "full  screen  repaints to be painted from the top line down.  By default, full screen repaints are done by scrolling from the bottom of the screen.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Dxcolor",
      "long": "--color",
      "value_type": "String",
      "takes_value": true,
      "description": "x is a single character which selects the type of text  whose  color  is being set:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": "--dumb",
      "value_type": "Bool",
      "takes_value": false,
      "description": "The -d option does not otherwise change the behavior of less on a dumb termi‐ nal.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--file-size",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Normally this is not done, because it can be slow if the input file is large.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--follow-name",
      "value_type": "File",
      "takes_value": true,
      "description": "of  the  original file  despite  its name change.  If --follow-name is specified, during an F command less will periodically attempt to reopen the file by name.  If the reopen succeeds and the file is a different file from the original (which means that a new  file  has  been  created with the same name as the original (now renamed) file), less will display the contents of that new file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-f",
      "long": "--force",
      "value_type": "Bool",
      "takes_value": false,
      "description": "non-regular  files  to be opened.  (A non-regular file is a directory or a device special file.)  Also suppresses the warning message when a binary file is opened.  By default, less will refuse to open non-regular files.  Note that some operating systems will not allow directories to be read, even if -f is set.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-?",
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": "(Depending on how your shell interprets the question mark, it may be necessary to quote the question mark, thus: \"-\\?\".)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-g",
      "long": "--hilite-search",
      "value_type": "String",
      "takes_value": true,
      "description": "The -g option changes this behavior to highlight only the particular string which was found by the last search command.  This can cause less to run somewhat faster than the default.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-w",
      "long": "--hilite-unread",
      "value_type": "String",
      "takes_value": true,
      "description": "highlights  the  first \"new\" line after a forward movement of a full page.  The first \"new\" line is the line immediately following the line previously at the bottom of the screen.  Also highlights the target line after a g or p command.  The highlight is removed at the next command which causes movement.  The entire line is highlighted, unless the -J option is in effect, in which  case only the status column is highlighted.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": "--ignore-case",
      "value_type": "Bool",
      "takes_value": false,
      "description": "searches  to ignore case; that is, uppercase and lowercase are considered identical.  This option is ignored if any uppercase letters appear in the search pattern; in other words, if a pattern contains uppercase letters, then that search does not ignore case.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--incsearch",
      "value_type": "Bool",
      "takes_value": false,
      "description": "search  commands will be \"incremental\"; that is, less will advance to the next line containing the search pattern as each character of the pattern is typed in.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-jn",
      "long": "--jump-target",
      "value_type": "File",
      "takes_value": true,
      "description": "The target line is the line specified by any command  to search  for a pattern, jump to a line number, jump to a file percentage or jump to a tag.  The screen line may be specified by a num‐ ber: the top line on the screen is 1, the next is 2, and so on.  The number may be negative to specify a line relative to the  bottom of  the  screen: the bottom line on the screen is -1, the second to the bottom is -2, and so on.  Alternately, the screen line may be specified as a fraction of the height of the screen, starting with a decimal point: .5 is in the middle of the screen,  .3  is  three tenths  down  from  the first line, and so on.  If the line is specified as a fraction, the actual line number is recalculated if the terminal window is resized, so that the target line remains at the specified fraction of the screen height.  If any form  of  the  -j option is used, repeated forward searches (invoked with \"n\" or \"N\") begin at the line immediately after the target line, and repeated backward searches begin at the target line, unless changed by -a or -A.  For example, if \"-j4\" is used, the target line is the fourth line  on  the  screen,  so forward searches begin at the fifth line on the screen.  However nonrepeated searches (invoked with \"/\" or \"?\")  always begin at the start or end of the current screen respectively.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-kfilename",
      "long": "--lesskey-file",
      "value_type": "File",
      "takes_value": true,
      "description": "less to open and interpret the named file as a lesskey(1) binary file.  Multiple -k options may be specified.  If the LESSKEY or LESSKEY_SYSTEM environment variable is set, or if a lesskey file is found in a standard place (see KEY BINDINGS), it is also  used as a lesskey file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--lesskey-src",
      "value_type": "File",
      "takes_value": true,
      "description": "If the LESSKEYIN or LESSKEYIN_SYSTEM environment vari‐ able  is  set, or if a lesskey source file is found in a standard place (see KEY BINDINGS), it is also used as a lesskey source file. Prior to version 582, the lesskey program needed to be run to convert a lesskey source file to a lesskey binary file for less to use. Newer versions of less read the lesskey source file directly and ignore the binary file if the source file exists.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": "--line-numbers",
      "value_type": "File",
      "takes_value": true,
      "description": "The default (to use line numbers) may cause less to run more slowly in some cases, especially with  a  very large  input  file.   Suppressing line numbers with the -n option will avoid this problem.  Using line numbers means: the line number will be displayed in the verbose prompt and in the = command, and the v command will pass the current line number to the editor  (see also the discussion of LESSEDIT in PROMPTS below).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-ofilename",
      "long": "--log-file",
      "value_type": "File",
      "takes_value": true,
      "description": "This applies only when the input file is a pipe, not an ordi‐ nary file.  If the file already exists, less will ask for confirmation before overwriting it.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-m",
      "long": "--long-prompt",
      "value_type": "Bool",
      "takes_value": false,
      "description": "By default, less prompts with a colon.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-hn",
      "long": "--max-back-scroll",
      "value_type": "Directory",
      "takes_value": true,
      "description": "If it is necessary to scroll backward more than n lines, the screen  is  re‐ painted in a forward direction instead.  (If the terminal does not have the ability to scroll backward, -h0 is implied.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-yn",
      "long": "--max-forw-scroll",
      "value_type": "String",
      "takes_value": true,
      "description": "If it is necessary to scroll forward more than n lines,  the  screen  is  re‐ painted instead.  The -c or -C option may be used to repaint from the top of the screen if desired.  By default, any forward movement causes scrolling.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--mouse",
      "value_type": "Bool",
      "takes_value": false,
      "description": "backwards  in  the file,  and clicking the mouse sets the \"#\" mark to the line where the mouse is clicked.  The number of lines to scroll when the wheel is moved can be set by the --wheel-lines option.  Mouse input works only on terminals which support X11 mouse reporting, and  on  the Windows version of less.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-histdups",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  history list,  the existing copy is removed from the history list before the new one is added.  Thus, a given string will appear only once in the history list.  Normally, a string may appear multiple times.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-X",
      "long": "--no-init",
      "value_type": "String",
      "takes_value": true,
      "description": "sending the termcap initialization and deinitialization strings to the terminal.  This is sometimes desirable if the deini‐ tialization string does something unnecessary, like clearing the screen.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-keypad",
      "value_type": "Bool",
      "takes_value": false,
      "description": "sending  the  keypad  initialization  and deinitialization strings to the terminal.  This is sometimes useful if the keypad strings make the numeric keypad behave in an undesirable manner.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": "--no-lessopen",
      "value_type": "File",
      "takes_value": true,
      "description": "This option can be set from within less, but it will apply only to files opened subsequently, not to the file which is currently open.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-ppattern",
      "long": "--pattern",
      "value_type": "File",
      "takes_value": true,
      "description": "occurrence  of pattern in the file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Pprompt",
      "long": "--prompt",
      "value_type": "String",
      "takes_value": true,
      "description": "a  way to tailor the three prompt styles to your own preference.  This option would normally be put in the LESS environment variable, rather than being typed in with each less command.  Such an option must either be the last option in the LESS variable,  or be terminated by a dollar sign.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-q",
      "long": "--quiet",
      "value_type": "Bool",
      "takes_value": false,
      "description": "beginning of the file.  If the terminal has a \"visual bell\", it is used instead.  The bell will be rung on certain other errors, such as typing an invalid character.  The default is to ring the terminal bell in all such cases.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-e",
      "long": "--quit-at-eof",
      "value_type": "Bool",
      "takes_value": false,
      "description": "By default, the only way to exit less is via the \"q\"  com‐ mand.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": "--quit-if-one-screen",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-K",
      "long": "--quit-on-intr",
      "value_type": "String",
      "takes_value": true,
      "description": "Normally, an interrupt  character causes  less  to stop whatever it is doing and return to its command prompt.  Note that use of this option makes it impossible to re‐ turn to the command prompt from the \"F\" command.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-\"cc",
      "long": "--quotes",
      "value_type": "File",
      "takes_value": true,
      "description": "This may be necessary if you are trying to name a file which contains both spaces and  quote characters.  Followed by a single character, this changes the quote character to that character.  Filenames containing a space should then  be  surrounded by that character rather than by double quotes.  Followed by two characters, changes the open quote to the first character, and the close quote to the second character.  Filenames containing a space should then be preceded by the open quote char‐ acter and followed by the close quote character.  Note that even after the quote characters are changed, this option  remains  -\"  (a dash followed by a double quote).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": "--raw-control-chars",
      "value_type": "Bool",
      "takes_value": false,
      "description": "The default is to display control characters using the caret notation; for example, a  control-A  (octal 001) is displayed as \"^A\".  Warning: when the -r option is used, less cannot keep track of the actual appearance of the screen (since this depends on how the screen responds to each type of control character).  Thus, various display problems  may result, such as long lines being split in the wrong place.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--rscroll",
      "value_type": "String",
      "takes_value": true,
      "description": "It may begin with a two-character  attribute  indicator  like  LESS‐ BINFMT does.  If there is no attribute indicator, standout is used.  If set to \"-\", truncated lines are not marked.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--save-marks",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-a",
      "long": "--search-skip-screen",
      "value_type": "Bool",
      "takes_value": false,
      "description": "bottom  of  the  displayed screen  (except for repeated searches invoked by the n or N commands, which start after or before the \"target\" line respectively; see the -j option for more about the target line).  The -a option causes forward searches to instead start at the bottom  of  the  screen and backward searches to start at the top of the screen, thus skipping all lines displayed on the screen.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-#",
      "long": "--shift",
      "value_type": "Number",
      "takes_value": true,
      "description": "If the number specified is zero, it sets the default number of positions to one half of the screen width. Alternately, the number may be specified as a fraction of the width of the screen, starting with a decimal point: .5 is half of the screen width, .3 is three tenths of the screen width, and so on. If the number is specified as a fraction, the actual number of scroll positions is recalculated if the terminal window is resized, so that the actual scroll remains at the specified fraction of the screen width.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": "--squeeze-blank-lines",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This is useful when viewing nroff output.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-J",
      "long": "--status-col-width",
      "value_type": "String",
      "takes_value": true,
      "description": "The status column shows the lines that matched the current search, and any lines that are marked (via the m or M command).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-xn",
      "long": "--tabs",
      "value_type": "String",
      "takes_value": true,
      "description": "tab stops.  If only one n is specified, tab stops are set at multiples of n.  If multiple values separated by commas are speci‐ fied, tab stops are set at those positions, and then continue with the same spacing as the last two.  For example,  -x9,17  will  set tabs at positions 9, 17, 25, 33, etc.  The default for n is 8.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-ttag",
      "long": "--tag",
      "value_type": "File",
      "takes_value": true,
      "description": "-t  option,  followed  immediately  by a TAG, will edit the file containing that tag.  For this to work, tag information must be available; for example, there may be a file in the current directory called \"tags\", which was previously  built  by  ctags(1)  or  an equivalent command.  If the environment variable LESSGLOBALTAGS is set, it is taken to be the name of a command compatible with glob‐ al(1),  and  that command is executed to find the tag.  (See http://www.gnu.org/software/global/global.html).  The -t option may also be specified from within less (using the - command) as a way of examining a new file.  The command \":t\" is equivalent  to  specifying",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Ttagsfile",
      "long": "--tag-file",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-~",
      "long": "--tilde",
      "value_type": "Bool",
      "takes_value": false,
      "description": "lines after end of file are displayed as a single tilde (~).  This option causes lines after end of file to be displayed as blank lines.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-u",
      "long": "--underline-special",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--use-backslash",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option changes the interpretations of options which follow this one.  After the --use-backslash option, any backslash in an op‐ tion string is removed and the following character is taken literally.  This allows a dollar sign to be included in option strings.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--use-color",
      "value_type": "String",
      "takes_value": true,
      "description": "The -D option can be used to change the colors.  Colored text works only if the terminal supports ANSI color escape sequences (as defined in ECMA-48 SGR; see https://www.ecma-international.org/publications-and-standards/standards/ecma-48).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": "--version",
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--wheel-lines",
      "value_type": "String",
      "takes_value": true,
      "description": "The default is  1 line.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-zn",
      "long": "--window",
      "value_type": "Number",
      "takes_value": true,
      "description": "The default is one screenful.  The z and w commands can also be used to change the  window  size.  The \"z\" may be omitted for compatibility with some versions of more.  If the number n is negative, it indicates n lines less than the current screen size.  For example, if the screen is 24 lines, -z-4 sets the scrolling window to 20 lines.  If the screen is resized to 40 lines, the scrolling window automatically changes to 36 lines.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-PM",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Ph",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Pm",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Ps",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Pw",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-[+]aABcCdeEfFgGiIJKLmMnNqQrRsSuUVwWX~",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-[z",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-h",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-j",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-k",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "use of lesskey files",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-x",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-y",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-{oO",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [
    {
      "name": "_",
      "description": "(Underscore.) Followed by one of the command line option letters, this will print a message describing the current setting of that",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "__",
      "description": "(Double underscore.) Like the _ (underscore) command, but takes a long option name rather than a single option letter. You must",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "g",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "m",
      "description": "Followed by any lowercase or uppercase letter, marks the first displayed line with that letter. If the status column is enabled via the -J option, the status column shows the marked line.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "n",
      "description": "Repeat previous search, for N-th line containing the last pattern. If the previous search was modified by ^N, the search is made for",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "replaced",
      "description": "by the name of the previously examined file. However, two consecutive percent signs are simply replaced with a single per‐",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "t",
      "description": "Go to the next tag, if there were more than one matches for the current tag. See the -t option for more details about tags.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "the",
      "description": "default for future RIGHTARROW and LEFTARROW commands. While the text is scrolled, it acts as though the -S option (chop lines) were in effect.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "v",
      "description": "Invokes an editor to edit the current file being viewed. The editor is taken from the environment variable VISUAL if defined, or ED‐",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "value",
      "description": "may be entered after the option letter. If no new value is entered, a message describing the current setting is printed and nothing is changed.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "w",
      "description": "Like ESC-v, but if N is specified, it becomes the new window size.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "z",
      "description": "Like SPACE, but if N is specified, it becomes the new window size.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    }
  ],
  "positional": [
    {
      "name": "-b",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-h",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-j",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-k",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-p",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-t",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-x",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "-y",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "alternate",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "for",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "keyfile",
      "value_type": "File",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "line",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "lines",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "logfile",
      "value_type": "File",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "long",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "names.",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "pattern",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "prompt",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "section",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "shift",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "space",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "syntax",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "tag",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "tagsfile",
      "value_type": "File",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "the",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "with",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "ManPage",
  "confidence": 1.0,
  "version": null
}