{
  "schema_version": "1.0.0",
  "command": "mkfs.ext4",
  "description": "mke2fs - create an ext2/ext3/ext4 file system",
  "global_flags": [
    {
      "short": "-C",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "cluster-size Specify  the  size  of cluster in bytes for file systems using the bigalloc feature.  Valid cluster-size values are from 2048 to 256M bytes per cluster.  This can only be specified if the bigalloc feature is enabled.  (See the ext4 (5) man page for more details about bigalloc.)   The default cluster size if bigalloc is enabled is 16 times the block size.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Use direct I/O when writing to the disk.  This avoids mke2fs dirtying a lot of buffer cache memory, which may impact  other  applica‐ tions  running on a busy server.  This option will cause mke2fs to run much more slowly, however, so there is a tradeoff to using di‐ rect I/O.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Extended options are comma separated, and may take an  argument  using  the  equals  ('=') sign.   The  -E option used to be -R in earlier versions of mke2fs.  The -R option is still accepted for backwards compatibility, but is deprecated.  The following extended options are supported:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Force  mke2fs to create a file system, even if the specified device is not a partition on a block special device, or if other parame‐ ters do not make sense.  In order to force mke2fs to create a file system even if the file system appears to be in use or is  mounted (a truly dangerous thing to do), this option must be specified twice.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-G",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  number  of  block groups that will be packed together to create a larger virtual block group (or \"flex_bg group\") in an ext4 file system.  This improves meta-data locality and performance on meta-data heavy workloads.  The number of  groups  must  be  a power of 2 and may only be specified if the flex_bg file system feature is enabled.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "The inode-size value must be a power of 2 larger or equal to 128.  The  larger  the  inode- size the more space the inode table will consume, and this reduces the usable space in the file system and can also negatively impact performance.  It is not possible to change this value after the file system is created.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-J",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  ext3 journal using options specified on the command-line.  Journal options are comma separated, and may take an argument using the equals ('=')  sign.  The following journal options are supported:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "The maximum length of the volume label is 16 bytes.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-M",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This might be useful for the sake of utilities that key off of the last  mounted directory to determine where the file system should be mounted.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-N",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  default calculation of the number of inodes that should be reserved for the file system (which is based on the number of blocks and the bytes-per-inode ratio).  This allows the user to specify the number of desired inodes directly.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-O",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "a  file  system with the given features (file system options), overriding the default file system options.  The features that are enabled by default are specified by the base_features relation, either in the [defaults] section in the /etc/mke2fs.conf configu‐ ration file, or in the [fs_types] subsections for the usage types as specified by the -T option, further modified by the features re‐ lation found in the [fs_types] subsections for the file system and usage types.  See the mke2fs.conf(5) manual page for more details. The file system type-specific configuration setting found in the [fs_types] section will override the global default  found  in  [de‐ faults].",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Write  superblock  and group descriptors only.  This is an extreme measure to be taken only in the very unlikely case that all of the superblock and backup superblocks are corrupted, and a last-ditch recovery method is desired by experienced users.  It causes  mke2fs to reinitialize the superblock and group descriptors, while not touching the inode table and the block and inode bitmaps.  The e2fsck program should be run immediately after this option is used, and there is no guarantee that any data will be salvageable.  Due to the wide variety of possible options to mke2fs that affect the on-disk layout, it is critical to specify exactly the same format options, such  as  blocksize, fs-type, feature flags, and other tunables when using this option, or the file system will be further corrupted. In some cases, such as file systems that have been resized, or have had features enabled after format time, it is impossible to over‐ write all of the superblocks correctly, and at least some file system corruption will occur.  It is best to run this on a  full  copy of the file system so other options can be tried if this doesn't work.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "use.   The  usage types  that are supported are defined in the configuration file /etc/mke2fs.conf.  The user may specify one or more usage types using a comma separated list.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "the universally unique identifier (UUID) of the file system to UUID.  The format of the UUID is a series of hex digits separated by hyphens, like this: \"c1b9d5a2-f162-11cf-9ece-0020afc76f16\".  The UUID parameter may also be one of the following:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Print the version number of mke2fs and exit.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  size of blocks in bytes.  Valid block-size values are powers of two from 1024 up to 65536 (however note that the kernel is able to mount only file systems with block-size smaller or equal to the system page size - 4k on x86 systems, up to 64k  on  ppc64 or  aarch64  depending  on kernel configuration).  If omitted, block-size is heuristically determined by the file system size and the expected usage of the file system (see the -T option).  In most common cases, the default block size is 4k. If block-size is preceded by a negative sign ('-'), then mke2fs will use heuristics to determine the appropriate block size, with the constraint that the block size will be at least block-size bytes.  This is useful for certain hardware devices which require that the blocksize be  a  multiple of 2k.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Check the device for bad blocks before creating the file system.  If this option is specified twice, then a slower read-write test is used instead of a fast read-only test.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-e",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "In all cases, a file system error will cause e2fsck(8) to check the file system on the next boot.  error-behavior can be one of the following:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-g",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "the number of blocks in a block group.  There is generally no reason for the user to ever set this parameter, as the default is optimal for the file system.  (For administrators who are creating file systems on RAID arrays, it is preferable to use the stride RAID parameter as part of the -E option rather than manipulating the number of blocks per group.)  This option is generally  used  by developers who are developing test cases.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "the bytes/inode ratio.  mke2fs creates an inode for every bytes-per-inode bytes of space on the disk.  The larger the bytes- per-inode ratio, the fewer inodes will be created.  This value generally shouldn't be smaller than the blocksize of the file  system, since in that case more inodes would be made than can ever be used.  Be warned that it is not possible to change this ratio on a file system  after  it  is created, so be careful deciding the correct value for this parameter.  Note that resizing a file system changes the number of inodes to maintain this ratio.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-j",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Create  the file system with an ext3 journal.  If the -J option is not specified, the default journal parameters will be used to cre‐ ate an appropriately sized journal (given the size of the file system) stored within the file system.  Note that you must be using  a kernel which has ext3 support in order to actually make use of the journal.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-l",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Note that the block numbers in the bad block list must be generated  using  the  same  block size  as  used  by mke2fs.  As a result, the -c option to mke2fs is a much simpler and less error-prone method of checking a disk for bad blocks before formatting it, as mke2fs will automatically pass the correct parameters to the badblocks program.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-m",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "This avoids fragmentation, and allows root-owned  dae‐ mons,  such  as  syslogd(8),  to continue to function correctly after non-privileged processes are prevented from writing to the file system.  The default percentage is 5%.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Causes  mke2fs  to  not  actually create a file system, but display what it would do if it were to create a file system.  This can be used to determine the location of the backup superblocks for a particular file system, so long as the  mke2fs  parameters  that  were passed when the file system was originally created are used again.  (With the -n option added, of course!)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-o",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "The creator field is set by default  to  the name of the OS the mke2fs executable was compiled for.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-q",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Quiet execution.  Useful if mke2fs is run in a script.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Note that 1.2 kernels only support revision 0 file systems.  The default is to create revision 1 file systems.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "If this option is not specified, mke2fs will pick a  default  either via how the command was run (for example, using a name of the form mkfs.ext2, mkfs.ext3, etc.) or via a default as defined by the /etc/mke2fs.conf file.   This option controls which file system options are used by default, based on the fstypes con‐ figuration stanza in /etc/mke2fs.conf.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Verbose execution.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "file.   This  undo  file  can  be  used  with e2undo(8)  to  restore the old contents of the file system should something go wrong.  If the empty string is passed as the undo_file argument, the undo file will be written to a file named mke2fs-device.e2undo in the directory specified  via  the  E2FSPROGS_UNDO_DIR environment variable or the undo_dir directive in the configuration file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [],
  "positional": [
    {
      "name": "device",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "external-journal",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "fs-size",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 0.9,
  "version": null
}