{
  "schema_version": "1.0.0",
  "command": "pic",
  "description": "pic - compile pictures for troff or TeX",
  "global_flags": [
    {
      "short": "-v",
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--version",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-C",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Recognize .PS, .PE, .PF, and .PY even when followed by a character other than space or newline.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Draw all lines using the \\D escape sequence.  GNU pic always does this.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Operate in safer mode; sh commands are ignored.  This mode, enabled by default, can be useful when operating on untrustworthy input.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "This is unnecessary because the troff output generated by GNU pic is device-independent.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Operate in unsafe mode; sh commands are interpreted.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Be  more  compatible  with tpic; implies -t.  Lines beginning with \\ are not passed through transparently.  Lines beginning with . are passed through with the initial . changed to \\.  A line beginning with .ps is given special treatment: it takes  an  optional  integer argument specifying the line thickness (pen size) in milliinches; a missing argument restores the previous line thickness; the default line  thickness is 8 milliinches.  The line thickness thus specified takes effect only when a non-negative line thickness has not been specified by use of the thickness attribute or by setting the linethick variable.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Don't use groff extensions to the troff drawing commands.  Specify this option if a postprocessor you're using doesn't  support  these extensions, described in groff_out(5).  This option also causes pic not to use zero-length lines to draw dots in troff mode.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Produce TeX output.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "In TeX mode, draw dots using zero-length lines.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [
    {
      "name": "An",
      "description": "alternative  may  be  to use the -Tpdf option to convert your picture directly into PDF format.  The MediaBox of the file produced can be controlled by passing a -P-p papersize to groff.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Boxes",
      "description": "can  have rounded corners.  The rad attribute specifies the radius of the quarter-circles at each corner.  If no rad or diam attribute is given, a radius of boxrad is used.  Initially, boxrad has a value of 0.  A box with rounded corners can be dotted or dashed.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Bugs",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Call",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Concatenate",
      "description": "arguments  and pass them as a line to troff or TeX.  Each arg must be an expression, a position, or text.  command allows the values of pic variables to be passed to the formatter.  For example, .PS x = 14 command \".ds string x is \" x \".\" .PE \\*[string] produces x is 14. when formatted with troff.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Conversion",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Each",
      "description": "text object has an invisible box associated with it.  The compass points of a text object are determined by this box.  The implicit mo‐ tion associated with the object is also determined by this box.  The dimensions of this box are taken from the width and  height  attributes; if  the  width  attribute is not supplied then the width will be taken to be textwid; if the height attribute is not supplied then the height will be taken to be the number of text strings associated with the object times textht.  Initially, textwid and textht have a value of 0.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Evaluate",
      "description": "expr;  if it is non-zero then do if-true, otherwise do if-false.  X can be any character not occurring in if-true.  Y can be any character not occurring in if-false.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Expressions",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Files",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "It",
      "description": "is  necessary to feed this file into groff without adding any page information, so you must check which .PS and .PE requests are actually called.  For example, the mm macro package adds a page number, which is very annoying.  At the moment, calling  standard  groff  without  any macro package works.  Alternatively, you can define your own requests, e.g., to do nothing:",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "Set",
      "description": "variable to expr1.  While the value of variable is less than or equal to expr2, do body and increment variable by expr3; if by is not given, increment variable by 1.  If expr3 is prefixed by * then variable will instead be multiplied by expr3.  The value of  expr3 can  be  negative for the additive case; variable is then tested whether it is greater than or equal to expr2.  For the multiplicative case, expr3 must be greater than zero.  If the constraints aren't met, the loop isn't executed.  X can be any character not  occurring in body.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "The",
      "description": "thickness  of  the  lines used to draw objects is controlled by the linethick variable.  This gives the thickness of lines in points.  A negative value means use the default thickness: in TeX output mode, this means use a thickness of 8 milliinches; in TeX output mode with  the",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "To",
      "description": "change the name of the vbox in TeX mode, set the pseudo-variable figname (which is actually a specially parsed command) within a picture. Example:",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "reset",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "would",
      "description": "draw a circle using a line with a thickness of 1.5 points.  The thickness of lines is not affected by the value of the scale variable, nor by the width or height given in the .PS line.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    }
  ],
  "positional": [],
  "source": "Merged",
  "confidence": 1.0,
  "version": null
}