{
  "schema_version": "1.0.0",
  "command": "rsync",
  "description": "rsync - a fast, versatile, remote (and local) file-copying tool",
  "global_flags": [
    {
      "short": "-A",
      "long": "--acls",
      "value_type": "String",
      "takes_value": true,
      "description": "The option also implies --perms.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--address",
      "value_type": "String",
      "takes_value": true,
      "description": "default rsync will bind to the wildcard address when connecting to an rsync daemon.  The --address option allows you to specify a specific IP address (or hostname) to bind to.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--append",
      "value_type": "Bool",
      "takes_value": false,
      "description": "on  the receiving  side  is  also known to be the same as the content on the sender.  The use of --append can be dangerous if you aren't 100% sure that all the files in the transfer are shared, growing files.  You should thus use filter rules to ensure that you weed out  any files that do not fit this criteria.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--append-verify",
      "value_type": "Bool",
      "takes_value": false,
      "description": "special  copy mode works like --append except that all the data in the file is included in the checksum verification (making it less efficient but also potentially safer).  This option can be dangerous if you aren't 100% sure that all the files in the  transfer are shared, growing files.  See the --append option for more details.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-a",
      "long": "--archive",
      "value_type": "File",
      "takes_value": true,
      "description": "is  equivalent  to  -rlptgoD.  It is a quick way of saying you want recursion and want to preserve almost everything.  Be aware that it does not include preserving ACLs (-A), xattrs (-X), atimes (-U), crtimes (-N), nor the finding and  preserving  of  hardlinks (-H).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": "--atimes",
      "value_type": "String",
      "takes_value": true,
      "description": "preserve access (use) times",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": "--backup",
      "value_type": "Bool",
      "takes_value": false,
      "description": "You can control where the backup file goes and what (if any) suffix gets appended using the --backup-dir and --suffix options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--backup-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "This can be used  for incremental backups.  You can additionally specify a backup suffix using the --suffix option (otherwise the files backed up in the specified directory will keep their original filenames).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-B",
      "long": "--block-size",
      "value_type": "File",
      "takes_value": true,
      "description": "It is normally selected based on the  size  of each file being updated.  See the technical report for details.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--blocking-io",
      "value_type": "Bool",
      "takes_value": false,
      "description": "If the remote shell is either rsh or remsh, rsync  de‐ faults to using blocking I/O, otherwise it defaults to using non-blocking I/O. (Note that ssh prefers non-blocking I/O.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--bwlimit",
      "value_type": "String",
      "takes_value": true,
      "description": "per  second.   The RATE  value  can be suffixed with a string to indicate a size multiplier, and may be a fractional value (e.g. --bwlimit=1.5m).  If no suffix is specified, the value will be assumed to be in units of 1024 bytes (as if \"K\" or \"KiB\" had been appended).  See  the  --max- size option for a description of all the available suffixes.  A value of 0 specifies no limit.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": "--checksum",
      "value_type": "Bool",
      "takes_value": false,
      "description": "changes  the  way rsync checks if the files have been changed and are in need of a transfer.  Without this option, rsync uses a \"quick check\" that (by default) checks if each file's size and time of last modification match between the sender and receiver.  This option changes this to compare a 128-bit checksum for each file that has a matching size.  Generating the checksums means  that  both sides  will  expend  a  lot of disk I/O reading all the data in the files in the transfer, so this can slow things down significantly (and this is prior to any reading that will be done to transfer changed files)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--checksum-choice",
      "value_type": "String",
      "takes_value": true,
      "description": "option  overrides  the checksum algorithms.  If one algorithm name is specified, it is used for both the transfer checksums and (assuming --checksum is specified) the pre-transfer checksums.  If two comma-separated names are supplied, the first name affects the transfer checksums, and the second name affects the pre-transfer checksums (-c).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--checksum-seed",
      "value_type": "File",
      "takes_value": true,
      "description": "This 4 byte checksum seed is included in each block and MD4 file checksum calculation (the more  modern  MD5 file checksums don't use a seed).  By default the checksum seed is generated by the server and defaults to the cur‐ rent time().  This option is used to set a specific checksum seed, which is useful for applications that want repeatable block check‐ sums, or in the case where the user wants a more random checksum seed.  Setting NUM to 0 causes rsync to use the  default  of  time() for checksum seed.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--chmod",
      "value_type": "Bool",
      "takes_value": false,
      "description": "affect file and/or directory permissions",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--chown",
      "value_type": "String",
      "takes_value": true,
      "description": "This is a simpler interface than using --usermap & --groupmap di‐ rectly, but it is implemented using those options internally so they cannot be mixed.  If either the USER or GROUP is empty, no  map‐ ping  for  the  omitted user/group will occur.  If GROUP is empty, the trailing colon may be omitted, but if USER is empty, a leading colon must be supplied.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compare-dest",
      "value_type": "Bool",
      "takes_value": false,
      "description": "also compare destination files relative to DIR",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": "--compress",
      "value_type": "String",
      "takes_value": true,
      "description": "The --compress option is implied as long as the level chosen is not a \"don't compress\" level for the compression algorithm that is in effect (e.g. zlib compression treats level 0 as \"off\").",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compress-choice",
      "value_type": "String",
      "takes_value": true,
      "description": "The option implies --compress unless \"none\" was specified, which instead implies --no-compress.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compress-level",
      "value_type": "Number",
      "takes_value": true,
      "description": "explicitly set compression level (aka --zl)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--contimeout",
      "value_type": "String",
      "takes_value": true,
      "description": "If the time‐ out is reached, rsync exits with an error.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-as",
      "value_type": "String",
      "takes_value": true,
      "description": "This only  works  if the  user  that  is  running rsync has the ability to change users.  If the group is not specified then the user's default groups are used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-dest",
      "value_type": "File",
      "takes_value": true,
      "description": "using  a local  copy.  This is useful for doing transfers to a new destination while leaving existing files intact, and then doing a flash-cu‐ tover when all files have been successfully transferred.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync to treat a device on the sending side as a regular file, allowing it to be copied to a normal destination file (or another device if --write-devices was also specified).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-k",
      "long": "--copy-dirlinks",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  causes  the  sending  side to treat a symlink to a directory as though it were a real directory.  This is useful if you don't want symlinks to non-directories to be affected, as they would be using --copy-links.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": "--copy-links",
      "value_type": "File",
      "takes_value": true,
      "description": "If a symlink chain is broken, an error is output and the file is dropped from the transfer.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-unsafe-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Absolute symlinks are also treated  like ordinary files, and so are any symlinks in the source path itself when --relative is used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-N",
      "long": "--crtimes",
      "value_type": "String",
      "takes_value": true,
      "description": "preserve create times (newness)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-C",
      "long": "--cvs-exclude",
      "value_type": "File",
      "takes_value": true,
      "description": "is  a  useful  shorthand for excluding a broad range of files that you often don't want to transfer between systems.  It uses a similar algorithm to CVS to determine if a file should be ignored.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--debug",
      "value_type": "Number",
      "takes_value": true,
      "description": "An individual flag name may be followed  by  a level  number,  with  0 meaning to silence that output, 1 being the default output level, and higher numbers increasing the output of that flag (for those that support higher levels).  Use --debug=help to see all the available flag names, what they output,  and  what flag names are added for each increase in the verbose level.  Some examples:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--del",
      "value_type": "Bool",
      "takes_value": false,
      "description": "an alias for --delete-during",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delay-updates",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option puts the temporary file from each updated file into a holding directory until the end of the transfer, at which time all the files are renamed into place in rapid succession.  This attempts to make the updating of the files a little more atomic.  By  de‐ fault the files are placed into a directory named .~tmp~ in each file's destination directory, but if you've specified the --partial- dir  option,  that directory will be used instead.  See the comments in the --partial-dir section for a discussion of how this .~tmp~ dir will be excluded from the transfer, and what you can do if you want rsync to cleanup old .~tmp~ dirs that might be lying  around. Conflicts with --inplace and --append.",
      "multiple": false,
      "conflicts_with": [
        "--partial-dir",
        "--inplace"
      ],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete",
      "value_type": "File",
      "takes_value": true,
      "description": "You must have asked rsync to send the whole directory (e.g. \"dir\" or \"dir/\") without using a wild‐ card  for the directory's contents (e.g. \"dir/*\") since the wildcard is expanded by the shell and rsync thus gets a request to trans‐ fer individual files, not the files' parent directory.  Files that are excluded from  the  transfer  are  also  excluded  from  being deleted  unless  you use the --delete-excluded option or mark the rules as only matching on the sending side (see the include/exclude modifiers in the FILTER RULES section).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-after",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This is useful if  you  are  sending new per-directory merge files as a part of the transfer and you want their exclusions to take effect for the delete phase of the cur‐ rent transfer.  It also forces rsync to use the old, non-incremental recursion algorithm that requires rsync to scan all the files in the transfer into memory at once (see --recursive). See --delete (which is implied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": [
        "--recursive",
        "--delete"
      ]
    },
    {
      "short": null,
      "long": "--delete-before",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  the file-deletions on the receiving side be done before the transfer starts.  See --delete (which is implied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-delay",
      "value_type": "Bool",
      "takes_value": false,
      "description": "after the transfer completes.  This is useful when combined with --delay-updates and/or --fuzzy, and is more efficient than using --delete- after  (but  can  behave differently, since --delete-after computes the deletions in a separate pass after all updates are done).  If the number of removed files overflows an internal buffer, a temporary file will be created on the receiving side to  hold  the  names (it is removed while open, so you shouldn't see it during the transfer).  If the creation of the temporary file fails, rsync will try to  fall  back  to using --delete-after (which it cannot do if --recursive is doing an incremental scan).  See --delete (which is im‐ plied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-during",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  the file-deletions on the receiving side be done incrementally as the transfer happens.  The per-directory delete scan is done right before each directory is checked for updates, so it behaves like a more efficient --delete-before, including doing  the deletions  prior  to any per-directory filter files being updated.  This option was first added in rsync version 2.6.4.  See --delete (which is implied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-excluded",
      "value_type": "Bool",
      "takes_value": false,
      "description": "also delete excluded files from dest dirs",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-missing-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "deletion request of the corresponding destination file on the receiving side (should it exist).  If the destination file is a non-empty direc‐ tory,  it will only be successfully deleted if --force or --delete are in effect.  Other than that, this option is independent of any other type of delete processing.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "If the receiv‐ ing  rsync  is not being run as the super-user, rsync silently skips creating the device files (see also the --super and --fake-super options).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": "--dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Unlike --recursive, a directory's contents are not copied un‐ less the directory name specified is \".\" or ends with a trailing slash (e.g.  \".\", \"dir/.\", \"dir/\", etc.).  Without  this  option  or the  --recursive  option,  rsync  will skip all directories it encounters (and output a message to that effect for each one).  If you specify both --dirs and --recursive, --recursive takes precedence.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": "--dry-run",
      "value_type": "Bool",
      "takes_value": false,
      "description": "makes  rsync perform a trial run that doesn't make any changes (and produces mostly the same output as a real run).  It is most commonly used in combination with the --verbose (-v) and/or --itemize-changes (-i) options to see what an rsync command is  going  to do before one actually runs it.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--early-input",
      "value_type": "File",
      "takes_value": true,
      "description": "One possible use of this data is to  give the script a secret that can be used to mount an encrypted filesystem (which you should unmount in the the \"post-xfer exec\" script).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--exclude",
      "value_type": "String",
      "takes_value": true,
      "description": "option is a simplified form of the --filter option that specifies an exclude rule and does not allow the full rule-parsing syn‐ tax of normal filter rules.  This is equivalent to specifying -f'- PATTERN'.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--exclude-from",
      "value_type": "File",
      "takes_value": true,
      "description": "Blank  lines in  the file are ignored, as are whole-line comments that start with ';' or '#' (filename rules that contain those characters are un‐ affected).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": "--executability",
      "value_type": "File",
      "takes_value": true,
      "description": "option causes rsync to preserve the executability (or non-executability) of regular files when --perms is not enabled.  A regu‐ lar file is considered to be executable if at least one 'x' is turned on in its permissions.  When an existing destination file's ex‐ ecutability differs from that of the corresponding source file, rsync modifies the destination file's permissions as follows:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "skip creating new files on receiver",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fake-super",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  are  attached  to  each file (as needed).  This includes the file's owner and group (if it is not the default), the file's device info (device & special files are created as empty text files), and any permission bits that we won't allow to be set on the real file (e.g. the real file gets u-s,g-s,o-t for safety) or that would limit the owner's access (since the real super-user  can always access/change a file, the files we create can always be accessed/changed by the creating user).  This option also handles ACLs (if --acls was specified) and non-user extended attributes (if --xattrs was specified).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--files-from",
      "value_type": "File",
      "takes_value": true,
      "description": "this option allows you to specify the exact list of files to transfer (as read from the specified FILE or '-' for standard in‐ put).  It also tweaks the default behavior of rsync to make transferring just the specified files and directories easier:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--filter",
      "value_type": "String",
      "takes_value": true,
      "description": "add a file-filtering RULE",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--force",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This is only relevant if dele‐ tions are not active (see --delete for details).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-0",
      "long": "--from0",
      "value_type": "File",
      "takes_value": true,
      "description": "NL,  CR,  or  CR+LF. This  affects  --exclude-from,  --include-from,  --files-from, and any merged files specified in a --filter rule.  It does not affect",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fsync",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  receiving  side to fsync each finished file.  This may slow down the transfer, but can help to provide peace of mind when updating critical files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-y",
      "long": "--fuzzy",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  tells rsync that it should look for a basis file for any destination file that is missing.  The current algorithm looks in the same directory as the destination file for either a file that has an identical size and modified-time,  or  a  similarly-named file.  If found, rsync uses the fuzzy basis file to try to speed up the transfer.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-g",
      "long": "--group",
      "value_type": "Bool",
      "takes_value": false,
      "description": "If the receiving program is not running as the super-user (or if --no-super was specified), only groups that the invoking user on the receiving side is a  member  of will be preserved.  Without this option, the group is set to the default group of the invoking user on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--groupmap",
      "value_type": "String",
      "takes_value": true,
      "description": "custom groupname mapping",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-H",
      "long": "--hard-links",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync to look for hard-linked files in the source and link together the corresponding files on the destination.  Without this option, hard-linked files in the source are treated as though they were separate files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": "a  short help page describing the options available in rsync and exit.  You can also use -h for --help when it is used without any other options (since it normally means --human-readable).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-h",
      "long": "--human-readable",
      "value_type": "Bool",
      "takes_value": false,
      "description": "See the --list-only option for one difference.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--iconv",
      "value_type": "File",
      "takes_value": true,
      "description": "Using a CONVERT_SPEC of \".\" tells rsync to look up the default character-set via the locale setting.  Alternately, you can fully specify what conversion to do  by  giving  a  local  and  a  remote charset  separated by a comma in the order --iconv=LOCAL,REMOTE, e.g. --iconv=utf8,iso88591.  This order ensures that the option will stay the same whether you're pushing or pulling files.  Finally, you can specify either --no-iconv or a CONVERT_SPEC of \"-\"  to  turn off  any  conversion.   The default setting of this option is site-specific, and can also be affected via the RSYNC_ICONV environment variable.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-errors",
      "value_type": "Bool",
      "takes_value": false,
      "description": "delete even if there are I/O errors",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells rsync to skip updating files that already exist on the destination (this does not ignore existing directories, or nothing would get done).  See also --ignore-non-existing.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-missing-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "command-line arguments or --files-from  entries),  it  is normally  an error if the file cannot be found.  This option suppresses that error, and does not try to transfer the file.  This does not affect subsequent vanished-file errors if a file was initially found to be present and later is no longer there.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-non-existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "If this option is combined with the --ignore-existing option, no files will be updated (which can be useful if all you want to do is delete extraneous files).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": "--ignore-times",
      "value_type": "File",
      "takes_value": true,
      "description": "rsync  will  skip any files that are already the same size and have the same modification timestamp.  This option turns off this \"quick check\" behavior, causing all files to be updated.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--inc-recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option explicitly enables on incremental recursion when scanning for files, which is enabled by default when using the --recur‐ sive option and both sides of the transfer are running rsync 3.0.0 or newer.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--include",
      "value_type": "String",
      "takes_value": true,
      "description": "option is a simplified form of the --filter option that specifies an include rule and does not allow the full rule-parsing syn‐ tax of normal filter rules.  This is equivalent to specifying -f'+ PATTERN'.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--include-from",
      "value_type": "File",
      "takes_value": true,
      "description": "Blank  lines in  the file are ignored, as are whole-line comments that start with ';' or '#' (filename rules that contain those characters are un‐ affected).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--info",
      "value_type": "Bool",
      "takes_value": false,
      "description": "fine-grained informational verbosity",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--inplace",
      "value_type": "Bool",
      "takes_value": false,
      "description": "of  creating  a  new copy  of  the  file  and  moving it into place when it is complete, rsync instead writes the updated data directly to the destination file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-4",
      "long": "--ipv4",
      "value_type": "Directory",
      "takes_value": true,
      "description": "rsync to prefer IPv4/IPv6 when creating sockets or running ssh.  This affects sockets that rsync has direct control over, such as the outgoing socket when directly contacting an rsync daemon, as well as the forwarding of the -4 or -6 option to ssh  when  rsync can  deduce  that  ssh is being used as the remote shell.  For other remote shells you'll need to specify the \"--rsh SHELL -4\" option directly (or whatever IPv4/IPv6 hint options it uses).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ipv6",
      "value_type": "Bool",
      "takes_value": false,
      "description": "prefer IPv6",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": "--itemize-changes",
      "value_type": "Bool",
      "takes_value": false,
      "description": "a  simple  itemized list of the changes that are being made to each file, including attribute changes.  This is exactly the same as specifying --out-format='%i %n%L'.  If you repeat the option, unchanged files will also be output, but only if the  receiving rsync  is  at  least  version 2.6.7 (you can use -vv with older versions of rsync, but that also turns on the output of other verbose messages).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-K",
      "long": "--keep-dirlinks",
      "value_type": "Directory",
      "takes_value": true,
      "description": "a real directory from the sender.  Without this option, the receiver's symlink would be deleted and replaced with a real directory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--link-dest",
      "value_type": "File",
      "takes_value": true,
      "description": "option  behaves like --copy-dest, but unchanged files are hard linked from DIR to the destination directory.  The files must be identical in all preserved attributes (e.g. permissions, possibly ownership) in order for the files to be linked together.  An  exam‐ ple:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-l",
      "long": "--links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "for  each  symlink  encoun‐ tered.  You can alternately silence the warning by specifying --info=nonreg0.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--list-only",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This option is inferred if there is a single source arg and no destination specified, so its main uses are:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--log-file",
      "value_type": "File",
      "takes_value": true,
      "description": "option causes rsync to log what it is doing to a file.  This is similar to the logging that a daemon does, but can be requested for the client side and/or the server side of a non-daemon transfer.  If specified as a client option, transfer logging will  be  en‐ abled with a default format of \"%i %n%L\".  See the --log-file-format option if you wish to override this.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--log-file-format",
      "value_type": "File",
      "takes_value": true,
      "description": "allows  you to specify exactly what per-update logging is put into the file specified by the --log-file option (which must also be specified for this option to have any effect).  If you specify an empty string, updated files will not be  mentioned  in  the  log file.  For a list of the possible escape characters, see the log format setting in the rsyncd.conf manpage.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-alloc",
      "value_type": "File",
      "takes_value": true,
      "description": "For most people this limit works just fine and prevents a protocol  error  causing  rsync  to  request massive amounts of memory.  However, if you have many millions of files in a transfer, a large amount of server memory, and you don't want to split up your transfer into multiple parts, you can increase the  per-allocation limit to something larger and rsync will consume more memory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-delete",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync  not  to  delete more than NUM files or directories.  If that limit is exceeded, all further deletions are skipped through the end of the transfer.  At the end, rsync outputs a warning (including a count of the skipped deletions) and exits with  an error code of 25 (unless some more important error condition also occurred).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-size",
      "value_type": "Number",
      "takes_value": true,
      "description": "A numeric  value  can  be  suffixed  with  a string to indicate the numeric units or left unqualified to specify bytes.  Feel free to use a fractional value along with the units, such as --max-size=1.5m.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--min-size",
      "value_type": "File",
      "takes_value": true,
      "description": "not  transferring  small, junk files.  See the --max-size option for a description of SIZE and other info.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--mkpath",
      "value_type": "Bool",
      "takes_value": false,
      "description": "create destination's missing path components",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--modify-window",
      "value_type": "File",
      "takes_value": true,
      "description": "comparing  two  timestamps,  rsync treats the timestamps as being equal if they differ by no more than the modify-window value. The default is 0, which matches just integer seconds.  If you specify a negative value (and the receiver is at least  version  3.1.3) then  nanoseconds will also be taken into account.  Specifying 1 is useful for copies to/from MS Windows FAT filesystems, because FAT represents times with a 2-second resolution (allowing times to differ from the original by up to 1 second).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--munge-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option affects just one side of the transfer and tells rsync to munge symlink values when it is receiving files or unmunge sym‐ link values when it is sending files.  The munged values make the symlinks unusable on disk but allows the original contents  of  the symlinks to be recovered.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-OPTION",
      "value_type": "Bool",
      "takes_value": false,
      "description": "may turn off one or more implied options by prefixing the option name with \"no-\".  Not all positive options have a negated oppo‐ site, but a lot do, including those that can be used to disable an implied option (e.g.  --no-D, --no-perms) or  have  different  de‐ faults  in  various  circumstances  (e.g. --no-whole-file, --no-blocking-io, --no-dirs).  Every valid negated option accepts both the short and the long option name after the \"no-\" prefix (e.g. --no-R is the same as --no-relative).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-implied-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  affects the default behavior of the --relative option.  When it is specified, the attributes of the implied directories from the source names are not included in the transfer.  This means that the corresponding path elements on  the  destination  system are  left  unchanged  if they exist, and any missing implied directories are created with default attributes.  This even allows these implied path elements to have big differences, such as being a symlink to a directory on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-inc-recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  new incremental recursion algorithm of the --recursive option.  This makes rsync scan the full file list before it be‐ gins to transfer files.  See --inc-recursive for more info.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-motd",
      "value_type": "String",
      "takes_value": true,
      "description": "option affects the information that is output by the client at the start of a daemon transfer.  This suppresses the message-of- the-day (MOTD) text, but it also affects the list of modules that the daemon sends in response to the \"rsync host::\" request (due  to a limitation in the rsync protocol), so omit this option if you want to request the list of modules from the daemon.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-relative",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-whole-file",
      "value_type": "Bool",
      "takes_value": false,
      "description": "whole-file updating when it is enabled by default for a local transfer.  This usually slows rsync down, but it can be useful if you are trying to minimize the writes to the destination file (if combined with --inplace) or for testing the  checksum-based  up‐ date algorithm.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--numeric-ids",
      "value_type": "Bool",
      "takes_value": false,
      "description": "don't map uid/gid values by user/group name",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--old-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "It also allows the client to treat an empty arg as a \".\" instead of generating an error.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--old-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "works like --dirs when talking to old rsync",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-O",
      "long": "--omit-dir-times",
      "value_type": "Directory",
      "takes_value": true,
      "description": "If NFS is sharing the directories on the receiving side, it is a good idea to use -O.  This option is inferred if you use --backup without --backup-dir.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-J",
      "long": "--omit-link-times",
      "value_type": "String",
      "takes_value": true,
      "description": "omit symlinks from --times",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-x",
      "long": "--one-file-system",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This does not limit the user's ability to specify items  to copy  from multiple filesystems, just rsync's recursion through the hierarchy of each directory that the user specified, and also the analogous recursion on the receiving side during deletion.  Also keep in mind that rsync treats a \"bind\" mount to the same device  as being on the same filesystem.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--only-write-batch",
      "value_type": "String",
      "takes_value": true,
      "description": "This lets you transport the changes to the destination system via some other means and then apply the changes via --read-batch.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--open-noatime",
      "value_type": "Bool",
      "takes_value": false,
      "description": "avoid changing the atime on opened files",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--out-format",
      "value_type": "File",
      "takes_value": true,
      "description": "The format is a text string con‐ taining  embedded  single-character escape sequences prefixed with a percent (%) character.  A default format of \"%n%L\" is assumed if either --info=name or -v is specified (this tells you just the name of the file and, if the item is a link, where it points).  For  a full list of the possible escape characters, see the log format setting in the rsyncd.conf manpage.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--outbuf",
      "value_type": "String",
      "takes_value": true,
      "description": "The mode can be None (aka Unbuffered), Line, or Block (aka Full).  You may specify as little as a single letter for the mode, and use upper or lower case.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-o",
      "long": "--owner",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option causes rsync to set the owner of the destination file to be the same as the source file, but only if the receiving rsync is being run as the super-user (see also the --super and --fake-super options).  Without this option, the owner of new and/or  trans‐ ferred files are set to the invoking user on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--partial",
      "value_type": "Bool",
      "takes_value": false,
      "description": "In some circumstances it is more desir‐ able to keep partially transferred files.  Using the --partial option tells rsync to keep the partial file which should make a subse‐ quent transfer of the rest of the file much faster.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--partial-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "This enhanced partial-file  method puts  any partially transferred files into the specified DIR instead of writing the partial file out to the destination file.  On the next transfer, rsync will use a file found in this dir as data to speed up the resumption of the transfer and then delete it after it has served its purpose.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--password-file",
      "value_type": "File",
      "takes_value": true,
      "description": "The  file should  contain  just  the  password on the first line (all other lines are ignored).  Rsync will exit with an error if FILE is world readable or if a root-run rsync command finds a non-root-owned file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": "--perms",
      "value_type": "Bool",
      "takes_value": false,
      "description": "permissions.  (See  also  the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--port",
      "value_type": "Url",
      "takes_value": true,
      "description": "This is only needed if you are using the  double- colon (::) syntax to connect with an rsync daemon (since the URL syntax has a way to specify the port as a part of the URL).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--preallocate",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Rsync will only  use the  real filesystem-level preallocation support provided by Linux's fallocate(2) system call or Cygwin's posix_fallocate(3), not the slow glibc implementation that writes a null byte into each block.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--progress",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This gives a bored user something to watch.  With a  modern rsync this is the same as specifying --info=flist2,name,progress, but any user-supplied settings for those info flags takes precedence (e.g.  --info=flist0 --progress).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--protocol",
      "value_type": "File",
      "takes_value": true,
      "description": "an  older  protocol  version to be used.  This is useful for creating a batch file that is compatible with an older version of rsync.  For instance, if rsync 2.6.4 is being used with the --write-batch option, but rsync 2.6.3 is what will be  used  to  run  the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-m",
      "long": "--prune-empty-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "have  no non-directory  children.  This is useful for avoiding the creation of a bunch of useless directories when the sending rsync is recur‐ sively scanning a hierarchy of files using include/exclude/filter rules.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-q",
      "long": "--quiet",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the remote server.  This option is useful when invoking rsync from cron.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--read-batch",
      "value_type": "File",
      "takes_value": true,
      "description": "If FILE is -, the batch  data  will  be  read from standard input. See the \"BATCH MODE\" section for details.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": "--recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "See also --dirs (-d) for an option that allows the scanning of a single directory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-R",
      "long": "--relative",
      "value_type": "File",
      "takes_value": true,
      "description": "This means that the full path names specified on the command line are sent to the server rather  than  just  the last  parts of the filenames.  This is particularly useful when you want to send several different directories at the same time.  For example, if you used this command:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-M",
      "long": "--remote-option",
      "value_type": "File",
      "takes_value": true,
      "description": "For instance, if you want to pass --log-file=FILE and --fake-super to the remote system, specify it like this:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--remove-source-files",
      "value_type": "Bool",
      "takes_value": false,
      "description": "and  have  been successfully duplicated on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-e",
      "long": "--rsh",
      "value_type": "String",
      "takes_value": true,
      "description": "option allows you to choose an alternative remote shell program to use for communication between the local and remote copies of rsync.  Typically, rsync is configured to use ssh by default, but you may prefer to use rsh on a local network.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--rsync-path",
      "value_type": "File",
      "takes_value": true,
      "description": "this  to specify what program is to be run on the remote machine to start-up rsync.  Often used when rsync is not in the default remote-shell's path (e.g. --rsync-path=/usr/local/bin/rsync).  Note that PROGRAM is run with the help of a shell, so it  can  be  any program,  script,  or command sequence you'd care to run, so long as it does not corrupt the standard-in & standard-out that rsync is using to communicate.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--safe-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  the receiving rsync to ignore any symbolic links in the transfer which point outside the copied tree.  All absolute sym‐ links are also ignored.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": "--secluded-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  remote  shell  command  line)  which avoids letting the remote shell modify them.  Wildcards are expanded on the remote host by rsync instead of a shell.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--size-only",
      "value_type": "Bool",
      "takes_value": false,
      "description": "modifies  rsync's \"quick check\" algorithm for finding files that need to be transferred, changing it from the default of trans‐ ferring files with either a changed size or a changed last-modified time to just looking for files that have changed in  size.   This is useful when starting to use rsync after using another mirroring system which may not preserve timestamps exactly.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--skip-compress",
      "value_type": "String",
      "takes_value": true,
      "description": "skip compressing files with suffix in LIST",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sockopts",
      "value_type": "Directory",
      "takes_value": true,
      "description": "option can provide endless fun for people who like to tune their systems to the utmost degree.  You can set all sorts of socket options which may make transfers faster (or slower!).  Read the manpage for the setsockopt() system call for details on some  of  the options  you may be able to set.  By default no special socket options are set.  This only affects direct socket connections to a re‐ mote rsync daemon.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": "--sparse",
      "value_type": "File",
      "takes_value": true,
      "description": "If combined with --inplace  the  file  created might  not  end  up with sparse blocks with some combinations of kernel version and/or filesystem type.  If --whole-file is in effect (e.g. for a local copy) then it will always work because rsync truncates the file prior to writing out the updated version.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--specials",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option causes rsync to transfer special files, such as named sockets and fifos.  If the receiving rsync is not being run as the super-user, rsync silently skips creating the special files (see also the --super and --fake-super options).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stats",
      "value_type": "Bool",
      "takes_value": false,
      "description": "is for your data.  This option is equivalent to --info=stats2 if combined with 0 or 1 -v options, or --info=stats3 if com‐ bined with 2 or more -v options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stderr",
      "value_type": "String",
      "takes_value": true,
      "description": "The mode strings can  be  ab‐ breviated, so feel free to use a single letter value.  The 3 possible choices are:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stop-after",
      "value_type": "String",
      "takes_value": true,
      "description": "Stop rsync after MINS minutes have elapsed",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stop-at",
      "value_type": "Number",
      "takes_value": true,
      "description": "in a  numeric  format  of year-month-dayThour:minute (e.g. 2000-12-31T23:59) in the local timezone.  You may choose to separate the date numbers using slashes instead of dashes.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--suffix",
      "value_type": "String",
      "takes_value": true,
      "description": "option  allows  you  to override the default backup suffix used with the --backup (-b) option.  The default suffix is a ~ if no",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--super",
      "value_type": "Bool",
      "takes_value": false,
      "description": "These  ac‐ tivities include: preserving users via the --owner option, preserving all groups (not just the current user's groups) via the --group option, and copying devices via the --devices option.  This is useful for systems that allow such activities without being the super- user, and also for ensuring that you will get errors if the receiving side isn't being run as the super-user.  To turn off super-user activities, the super-user can use --no-super.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": "--temp-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "receiv‐ ing side.  The default behavior is to create each temporary file in the same directory as the associated destination file.  Beginning with  rsync 3.1.1, the temp-file names inside the specified DIR will not be prefixed with an extra dot (though they will still have a random suffix added).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--timeout",
      "value_type": "String",
      "takes_value": true,
      "description": "If no data is transferred for the specified  time  then  rsync  will exit.  The default is 0, which means no timeout.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": "--times",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells rsync to transfer modification times along with the files and update them on the remote system.  Note that if this option is not used, the optimization that excludes files that have not been modified cannot be effective; in other words, a missing  -t  (or",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--trust-sender",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  disables  two extra validation checks that a local client performs on the file list generated by a remote sender.  This option should only be used if you trust the sender to not put something malicious in the file list (something that could possibly  be done via a modified rsync, a modified shell, or some other similar manipulation).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-u",
      "long": "--update",
      "value_type": "Bool",
      "takes_value": false,
      "description": "file.  (If an existing destination file has a modification time equal to the source file's, it will be updated if the sizes are different.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--usermap",
      "value_type": "Number",
      "takes_value": true,
      "description": "The STRING  is  one or  more  FROM:TO  pairs of values separated by commas.  Any matching FROM value from the sender is replaced with a TO value from the receiver.  You may specify usernames or user IDs for the FROM and TO values, and the FROM value may also be a wild-card string, which will be matched against the sender's names (wild-cards do NOT match against ID numbers, though see below for why a '*' matches every‐ thing).  You may instead specify a range of ID numbers via an inclusive range: LOW-HIGH.  For example:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": "--verbose",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  increases  the amount of information you are given during the transfer.  By default, rsync works silently.  A single -v will give you information about what files are being transferred and a brief summary at the end.  Two -v options will give you infor‐ mation on what files are being skipped and slightly more information at the end.  More than two -v options should only be used if you are debugging rsync.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": "--version",
      "value_type": "String",
      "takes_value": true,
      "description": "When repeated, the information is output is a JSON format  that  is  still  fairly readable (client side only).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-W",
      "long": "--whole-file",
      "value_type": "File",
      "takes_value": true,
      "description": "option  disables  rsync's  delta-transfer  algorithm, which causes all transferred files to be sent whole.  The transfer may be faster if this option is used when the bandwidth between the source and destination machines is higher than  the  bandwidth  to  disk (especially when the \"disk\" is actually a networked filesystem).  This is the default when both the source and destination are speci‐ fied as local paths, but only if no batch-writing option is in effect.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--write-batch",
      "value_type": "String",
      "takes_value": true,
      "description": "See the \"BATCH  MODE\"  section  for  de‐ tails, and also the --only-write-batch option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--write-devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "write to devices as files (implies --inplace)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-X",
      "long": "--xattrs",
      "value_type": "String",
      "takes_value": true,
      "description": "preserve extended attributes",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-8",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "valid  in the current locale and escaping the invalid ones.  All control characters (but never tabs) are always escaped, regardless of this op‐ tion's setting.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "The -D option is equivalent to \"--devices --specials\".",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "The -F option is a shorthand for adding two --filter rules to your command.  The first time it is used is a shorthand for this rule:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "The -P option is equivalent to \"--partial --progress\".  Its purpose is to make it much easier to specify these two options for a long transfer that may be interrupted.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [
    {
      "name": "--no-old-args",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "--no-secluded-args",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "o",
      "description": "an option was specified that is supported by the client and not by the server",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "reduced",
      "description": "list of names. Use the command rsync --version to see the available compression names. See the --compress option for full details.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    }
  ],
  "positional": [
    {
      "name": "and",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "at",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "available",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "copying",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "cross-linking",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "dest",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "files",
      "value_type": "File",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "includes",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "instead",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "is",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "just",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "list",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "manpage",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "no",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "of",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "one",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "online",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "source",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "src",
      "value_type": "String",
      "required": true,
      "multiple": true,
      "description": null
    },
    {
      "name": "that",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "the",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "this",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "topics",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "version",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "will",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "with",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 1.0,
  "version": "3.2.7"
}