{
  "schema_version": "1.0.0",
  "command": "rsync",
  "description": "rsync - a fast, versatile, remote (and local) file-copying tool",
  "global_flags": [
    {
      "short": "-A",
      "long": "--acls",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  causes  rsync to update the destination ACLs to be the same as the source ACLs.  The option also implies --perms.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--address",
      "value_type": "String",
      "takes_value": true,
      "description": "The  --address  option  allows  you  to specify a specific IP address (or hostname) to bind to.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--append",
      "value_type": "Bool",
      "takes_value": false,
      "description": "special  copy  mode only works to efficiently update files that are known to be growing larger where any  existing  content on  the  receiving side is also known to be the same as the con‐ tent on the sender.  The use of --append can be dangerous if you aren't 100% sure that all the files in the transfer are  shared, growing  files.  You should thus use filter rules to ensure that you weed out any files that do not fit this criteria.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--append-verify",
      "value_type": "Bool",
      "takes_value": false,
      "description": "all  the data  in the file is included in the checksum verification (mak‐ ing it less efficient but also potentially safer).  This  option can  be  dangerous if you aren't 100% sure that all the files in the transfer are shared, growing files.  See the --append option for more details.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-a",
      "long": "--archive",
      "value_type": "File",
      "takes_value": true,
      "description": "It is a quick way of saying you want recursion and want to preserve almost everything.  Be aware that  it  does  not  include  preserving ACLs (-A), xattrs (-X), atimes (-U), crtimes (-N), nor the  finding  and  preserving  of hardlinks (-H).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-U",
      "long": "--atimes",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync to set the access (use) times of the destina‐ tion files to the same value as the source files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-b",
      "long": "--backup",
      "value_type": "Bool",
      "takes_value": false,
      "description": "this  option, preexisting destination files are renamed as each file is transferred or deleted.  You can control where  the backup  file  goes  and what (if any) suffix gets appended using the --backup-dir and --suffix options.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--backup-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "implies  the --backup option, and tells rsync to store all backups in the specified directory on the receiving side.   This can be used for incremental backups.  You can additionally spec‐ ify  a  backup  suffix  using the --suffix option (otherwise the files backed up in the specified directory will keep their orig‐ inal filenames).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-B",
      "long": "--block-size",
      "value_type": "File",
      "takes_value": true,
      "description": "algo‐ rithm  to  a  fixed value.  It is normally selected based on the size of each file being updated.  See the technical  report  for details.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--blocking-io",
      "value_type": "Bool",
      "takes_value": false,
      "description": "when  launching  a  remote shell  transport.   If  the remote shell is either rsh or remsh, rsync defaults to using blocking I/O, otherwise it  defaults  to using  non-blocking  I/O.  (Note  that  ssh prefers non-blocking I/O.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--bwlimit",
      "value_type": "String",
      "takes_value": true,
      "description": "for the  data  sent  over the socket, specified in units per second. The RATE value can be suffixed with a string to indicate a  size multiplier, and may be a fractional value (e.g. --bwlimit=1.5m). If  no  suffix  is specified, the value will be assumed to be in units of 1024 bytes (as if \"K\" or \"KiB\" had been appended).  See the --max-size option for a description  of  all  the  available suffixes.  A value of 0 specifies no limit.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-c",
      "long": "--checksum",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Without this option, rsync  uses a \"quick check\" that (by default) checks if each file's size and time of last modification match between the sender and receiver. This  option changes this to compare a 128-bit checksum for each file that has a matching size.  Generating the  checksums  means that  both  sides  will expend a lot of disk I/O reading all the data in the files in the transfer, so this can slow things  down significantly  (and  this  is  prior to any reading that will be done to transfer changed files)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--checksum-choice",
      "value_type": "String",
      "takes_value": true,
      "description": "If one algorithm name is specified, it is used for both  the  transfer  checksums and  (assuming  --checksum is specified) the pre-transfer check‐ sums.  If two comma-separated names are supplied, the first name affects the transfer checksums, and the second name affects  the pre-transfer checksums (-c).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--checksum-seed",
      "value_type": "File",
      "takes_value": true,
      "description": "the checksum seed to the integer NUM.  This 4 byte checksum seed is included in each block and MD4 file checksum calculation (the more modern MD5 file checksums don't use a seed).   By  de‐ fault  the checksum seed is generated by the server and defaults to the current time().  This option is used to  set  a  specific checksum  seed,  which  is useful for applications that want re‐ peatable block checksums, or in the case where the user wants  a more random checksum seed.  Setting NUM to 0 causes rsync to use the default of time() for checksum seed.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--chmod",
      "value_type": "File",
      "takes_value": true,
      "description": "en‐ abled).   If  you'd  care to make this latter behavior easier to type, you could define a popt alias for it, such as putting this line in the file ~/.popt (the following defines the  -Z  option, and  includes --no-g to use the default group of the destination dir):",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--chown",
      "value_type": "String",
      "takes_value": true,
      "description": "owned  by  USER  with  group GROUP.   This  is  a  simpler  interface  than using --usermap &",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compare-dest",
      "value_type": "File",
      "takes_value": true,
      "description": "the  destination  ma‐ chine  as  an  additional hierarchy to compare destination files against doing transfers (if the files are missing in the  desti‐ nation  directory).  If a file is found in DIR that is identical to the sender's file, the file will NOT be  transferred  to  the destination  directory.   This  is  useful for creating a sparse backup of just files that have changed from an  earlier  backup. This  option  is  typically used to copy into an empty (or newly created) directory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-z",
      "long": "--compress",
      "value_type": "String",
      "takes_value": true,
      "description": "The --compress option is implied as long as the level chosen is not a \"don't compress\" level for the compression algorithm that is in effect (e.g. zlib compres‐ sion treats level 0 as \"off\").",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compress-choice",
      "value_type": "String",
      "takes_value": true,
      "description": "compression  algorithm that occurs when --compress is used. The option implies --compress unless \"none\" was specified, which instead implies --no-compress.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--compress-level",
      "value_type": "Number",
      "takes_value": true,
      "description": "explicitly set compression level (aka --zl)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--contimeout",
      "value_type": "String",
      "takes_value": true,
      "description": "for  its connection to an rsync daemon to succeed.  If the timeout is reached, rsync exits with an error.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-as",
      "value_type": "String",
      "takes_value": true,
      "description": "and  (if  specified after  a  colon)  the  GROUP for the copy operations.  This only works if the user that is  running  rsync  has  the  ability  to change users.  If the group is not specified then the user's de‐ fault groups are used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-dest",
      "value_type": "File",
      "takes_value": true,
      "description": "but  rsync  will  also copy  unchanged  files found in DIR to the destination directory using a local copy.  This is useful for doing transfers to a new destination while leaving existing files intact, and then  doing a  flash-cutover  when  all  files have been successfully trans‐ ferred.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "copy device contents as a regular file",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-k",
      "long": "--copy-dirlinks",
      "value_type": "Bool",
      "takes_value": false,
      "description": "di‐ rectory  as  though it were a real directory.  This is useful if you don't want symlinks to non-directories to  be  affected,  as they would be using --copy-links.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": "--copy-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  transfer into  the referent item, following the symlink chain to the file or directory that it references.  If a symlink chain is  broken, an error is output and the file is dropped from the transfer.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--copy-unsafe-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "of  symbolic  links  that point  outside  the  copied  tree.   Absolute  symlinks are also treated like ordinary files, and so  are  any  symlinks  in  the source path itself when --relative is used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-N",
      "long": "--crtimes",
      "value_type": "Bool",
      "takes_value": false,
      "description": "preserve create times (newness)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-C",
      "long": "--cvs-exclude",
      "value_type": "File",
      "takes_value": true,
      "description": "is a useful shorthand for excluding a broad range of files that you often don't want to transfer between systems.  It  uses a  similar algorithm to CVS to determine if a file should be ig‐ nored.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--debug",
      "value_type": "Number",
      "takes_value": true,
      "description": "over  the  debug output you want to see.  An individual flag name may be followed by  a level number, with 0 meaning to silence that output, 1 be‐ ing the default output level, and higher numbers increasing  the output of that flag (for those that support higher levels).  Use",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--del",
      "value_type": "Bool",
      "takes_value": false,
      "description": "an alias for --delete-during",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delay-updates",
      "value_type": "Bool",
      "takes_value": false,
      "description": "into a holding directory until the end of the transfer, at which time all  the files are renamed into place in rapid succession.  This attempts to make the updating of the files a little more atomic. By default the files are placed into a directory named .~tmp~ in each file's destination directory, but if you've  specified  the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync to delete extraneous files from the receiving side (ones that aren't on the sending side), but  only  for  the directories  that  are  being synchronized.  You must have asked rsync to send the whole directory (e.g. \"dir\" or \"dir/\") without using a wildcard for the  directory's  contents  (e.g.  \"dir/*\") since  the wildcard is expanded by the shell and rsync thus gets a request to transfer individual files, not  the  files'  parent directory.   Files  that are excluded from the transfer are also excluded from being deleted unless you use the --delete-excluded option or mark the rules as only matching on  the  sending  side (see the include/exclude modifiers in the FILTER RULES section).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-after",
      "value_type": "Bool",
      "takes_value": false,
      "description": "receiver deletes after transfer, not during",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-before",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  the  file-deletions on the receiving side be done before the transfer starts.  See --delete (which is implied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-delay",
      "value_type": "Bool",
      "takes_value": false,
      "description": "side  be  com‐ puted  during  the transfer (like --delete-during), and then re‐ moved after the transfer completes.  This is  useful  when  com‐ bined with --delay-updates and/or --fuzzy, and is more efficient than  using  --delete-after  (but  can behave differently, since",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-during",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  the  file-deletions on the receiving side be done incrementally as the transfer happens.  The per-directory delete scan is done right before each directory is checked for updates, so it behaves like a more efficient  --delete-before,  including doing  the deletions prior to any per-directory filter files be‐ ing updated.  This option  was  first  added  in  rsync  version 2.6.4.   See  --delete  (which  is  implied) for more details on file-deletion.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-excluded",
      "value_type": "Bool",
      "takes_value": false,
      "description": "unqualified  exclude/include  rules  into server-side rules that do not affect the receiver's deletions.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--delete-missing-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "(implied)  --ignore-miss‐ ing-args  option  a step farther: each missing arg will become a deletion request of the corresponding destination  file  on  the receiving  side (should it exist).  If the destination file is a non-empty directory, it will only  be  successfully  deleted  if",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option causes rsync to transfer character and block device files to the remote system to recreate these  devices.   If  the receiving  rsync  is  not  being  run  as  the super-user, rsync silently skips creating the device files (see also  the  --super and --fake-super options).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "(-d)  for an option that allows the scanning of a single directory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": "--dry-run",
      "value_type": "Bool",
      "takes_value": false,
      "description": "makes  rsync  perform  a  trial  run that doesn't make any changes (and produces mostly the same output as a real run).  It is most commonly used in combination  with  the  --verbose  (-v) and/or  --itemize-changes (-i) options to see what an rsync com‐ mand is going to do before one actually runs it.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--early-input",
      "value_type": "File",
      "takes_value": true,
      "description": "option allows rsync to send up to 5K of data to the \"early exec\" script on its stdin.  One possible use of this data is  to give  the script a secret that can be used to mount an encrypted filesystem (which you should unmount in the the \"post-xfer exec\" script).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--exclude",
      "value_type": "String",
      "takes_value": true,
      "description": "option  is  a  simplified form of the --filter option that specifies an exclude rule and does not allow the full rule-pars‐ ing syntax of normal filter rules.  This is equivalent to speci‐ fying -f'- PATTERN'.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--exclude-from",
      "value_type": "File",
      "takes_value": true,
      "description": "FILE  that  contains  exclude patterns (one per line).  Blank lines in the file are ignored, as are whole-line  comments  that start with ';' or '#' (filename rules that contain those charac‐ ters are unaffected).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": "--executability",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option causes rsync to preserve the executability (or non- executability) of regular files when --perms is not enabled.   A regular  file is considered to be executable if at least one 'x' is turned on in its permissions.  When an  existing  destination file's  executability  differs  from  that  of the corresponding source file, rsync modifies the destination  file's  permissions as follows:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "skip creating new files on receiver",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fake-super",
      "value_type": "Bool",
      "takes_value": false,
      "description": "this option is enabled, rsync simulates super-user activi‐ ties by saving/restoring the privileged attributes  via  special extended  attributes that are attached to each file (as needed). This includes the file's owner and group (if it is not  the  de‐ fault),  the file's device info (device & special files are cre‐ ated as empty text files), and any permission bits that we won't allow to be set on the real file (e.g. the real file gets u-s,g- s,o-t for safety) or that would limit the owner's access  (since the  real  super-user can always access/change a file, the files we create can always be accessed/changed by the creating  user). This option also handles ACLs (if --acls was specified) and non- user extended attributes (if --xattrs was specified).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--files-from",
      "value_type": "Bool",
      "takes_value": false,
      "description": "read list of source-file names from FILE",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--filter",
      "value_type": "String",
      "takes_value": true,
      "description": "add a file-filtering RULE",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--force",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Other than that, this option is independent of any other type of delete processing.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-0",
      "long": "--from0",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync that the rules/filenames it reads from a file are terminated by a null ('\\0') character,  not  a  NL,  CR,  or CR+LF.   This  affects  --exclude-from, --include-from, --files- from, and any merged files specified in  a  --filter  rule.   It does  not  affect  --cvs-exclude  (since  all  names read from a .cvsignore file are split on whitespace).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--fsync",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the receiving side to fsync each finished file.  This may slow down the transfer, but can help to provide  peace  of  mind when updating critical files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-y",
      "long": "--fuzzy",
      "value_type": "Bool",
      "takes_value": false,
      "description": "destination  file  that  is missing.  The current algorithm looks in the same directory as the destination file for either a file that has an identical size and modified-time,  or  a  simi‐ larly-named  file.  If found, rsync uses the fuzzy basis file to try to speed up the transfer.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-g",
      "long": "--group",
      "value_type": "Bool",
      "takes_value": false,
      "description": "group  of  the  destination file  to  be the same as the source file.  If the receiving pro‐ gram is not running as the  super-user  (or  if  --no-super  was specified),  only groups that the invoking user on the receiving side is a member of will be preserved.  Without this option, the group is set to the default group of the invoking  user  on  the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--groupmap",
      "value_type": "String",
      "takes_value": true,
      "description": "those  options internally so they cannot be mixed.  If either the USER or GROUP is  empty, no mapping for the omitted user/group will occur.  If GROUP is empty, the trailing colon may be omitted, but  if  USER is empty, a leading colon must be supplied.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-H",
      "long": "--hard-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "With‐ out  this option, hard-linked files in the source are treated as though they were separate files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": "describing  the  options  available  in rsync  and exit.  You can also use -h for --help when it is used without any other options (since it normally means --human-read‐ able).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-h",
      "long": "--human-readable",
      "value_type": "Bool",
      "takes_value": false,
      "description": "format.   There  are  3 possible levels:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--iconv",
      "value_type": "File",
      "takes_value": true,
      "description": "can  convert  filenames between character sets using this option.  Using a CONVERT_SPEC of \".\" tells rsync to look up  the default  character-set via the locale setting.  Alternately, you can fully specify what conversion to do by giving a local and  a remote  charset  separated  by  a comma in the order --iconv=LO‐ CAL,REMOTE, e.g. --iconv=utf8,iso88591.  This order ensures that the option will stay the same whether you're pushing or  pulling files.   Finally,  you  can  specify either --no-iconv or a CON‐ VERT_SPEC of \"-\" to turn off any conversion.  The  default  set‐ ting  of  this option is site-specific, and can also be affected via the RSYNC_ICONV environment variable.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-errors",
      "value_type": "Bool",
      "takes_value": false,
      "description": "--delete to go ahead and delete files even when there are I/O errors.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "already  exist  on the  destination  (this does not ignore existing directories, or nothing would get done).  See also --ignore-non-existing.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-missing-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "requested  source files (e.g.  command-line arguments or --files-from entries), it is  normally  an error if the file cannot be found.  This option suppresses that error, and does not try to  transfer  the  file. This  does  not affect subsequent vanished-file errors if a file was initially found to be present and later is no longer there.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ignore-non-existing",
      "value_type": "Bool",
      "takes_value": false,
      "description": "in that that they cause rsync to transfer fewer files, while this option causes  rsync  to  transfer  more files.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": "--ignore-times",
      "value_type": "Bool",
      "takes_value": false,
      "description": "rsync  will  skip  any files that are already the same size and have the  same  modification  timestamp.   This  option turns  off  this \"quick check\" behavior, causing all files to be updated.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--inc-recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "on  incremental  recursion  when scanning  for  files, which is enabled by default when using the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--include",
      "value_type": "String",
      "takes_value": true,
      "description": "option  is  a  simplified form of the --filter option that specifies an include rule and does not allow the full rule-pars‐ ing syntax of normal filter rules.  This is equivalent to speci‐ fying -f'+ PATTERN'.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--include-from",
      "value_type": "File",
      "takes_value": true,
      "description": "FILE  that  contains  include patterns (one per line).  Blank lines in the file are ignored, as are whole-line  comments  that start with ';' or '#' (filename rules that contain those charac‐ ters are unaffected).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--info",
      "value_type": "Number",
      "takes_value": true,
      "description": "output  you  want  to see.  An individual flag name may be followed by a level number, with 0 meaning to silence that  out‐ put,  1  being  the default output level, and higher numbers in‐ creasing the output of that flag (for those that support  higher levels).   Use  --info=help to see all the available flag names, what they output, and what flag names are  added  for  each  in‐ crease in the verbose level.  Some examples:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--inplace",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  changes  how  rsync transfers a file when its data needs to be updated: instead of the default method of creating a new copy of the file and moving it into place when  it  is  com‐ plete,  rsync  instead  writes  the updated data directly to the destination file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-4",
      "long": "--ipv4",
      "value_type": "Directory",
      "takes_value": true,
      "description": "This affects sockets that rsync has direct  control  over, such  as  the  outgoing socket when directly contacting an rsync daemon, as well as the forwarding of the -4 or -6 option to  ssh when  rsync  can  deduce  that  ssh  is being used as the remote shell.  For other remote  shells  you'll  need  to  specify  the \"--rsh SHELL -4\" option directly (or whatever IPv4/IPv6 hint op‐ tions it uses).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--ipv6",
      "value_type": "Bool",
      "takes_value": false,
      "description": "prefer IPv6",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": "--itemize-changes",
      "value_type": "Bool",
      "takes_value": false,
      "description": "a  simple  itemized list of the changes that are being made to each file, including attribute changes.  This is exactly the same as specifying --out-format='%i %n%L'.   If  you  repeat the option, unchanged files will also be output, but only if the receiving  rsync is at least version 2.6.7 (you can use -vv with older versions of rsync, but that also turns on  the  output  of other verbose messages).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-K",
      "long": "--keep-dirlinks",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  causes  the receiving side to treat a symlink to a directory as though it were a real directory,  but  only  if  it matches  a real directory from the sender.  Without this option, the receiver's symlink would be deleted and replaced with a real directory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--link-dest",
      "value_type": "Bool",
      "takes_value": false,
      "description": "hardlink to files in DIR when unchanged",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-l",
      "long": "--links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "ignor‐ ing  them with a \"non-regular file\" warning for each symlink en‐ countered.  You can alternately silence the warning by  specify‐ ing --info=nonreg0.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--list-only",
      "value_type": "Bool",
      "takes_value": false,
      "description": "usage)  if",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--log-file",
      "value_type": "File",
      "takes_value": true,
      "description": "option  causes  rsync  to  log what it is doing to a file. This is similar to the logging that a daemon does,  but  can  be requested  for  the client side and/or the server side of a non- daemon transfer.  If specified as a client option, transfer log‐ ging will be enabled with a default format of  \"%i  %n%L\".   See the --log-file-format option if you wish to override this.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--log-file-format",
      "value_type": "File",
      "takes_value": true,
      "description": "allows  you  to specify exactly what per-update logging is put into the file specified by the --log-file option (which must also be specified for this option to have any effect).   If  you specify  an empty string, updated files will not be mentioned in the log file.  For a list of the possible escape characters, see the log format setting in the rsyncd.conf manpage.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-alloc",
      "value_type": "File",
      "takes_value": true,
      "description": "malloc/realloc  to  about 1GB  in  size.   For  most people this limit works just fine and prevents a protocol  error  causing  rsync  to  request  massive amounts  of memory.  However, if you have many millions of files in a transfer, a large amount of server memory,  and  you  don't want  to split up your transfer into multiple parts, you can in‐ crease the per-allocation limit to something  larger  and  rsync will consume more memory.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-delete",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync not to delete more than NUM files or directo‐ ries.  If that limit is  exceeded,  all  further  deletions  are skipped through the end of the transfer.  At the end, rsync out‐ puts  a warning (including a count of the skipped deletions) and exits with an error code of 25 (unless some more important error condition also occurred).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--max-size",
      "value_type": "File",
      "takes_value": true,
      "description": "tells  rsync to avoid transferring any file that is larger than the specified SIZE.  A numeric value can be suffixed with a string to indicate the numeric  units  or  left  unqualified  to specify  bytes.   Feel free to use a fractional value along with the units, such as --max-size=1.5m.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--min-size",
      "value_type": "File",
      "takes_value": true,
      "description": "smaller than  the  specified  SIZE,  which  can help in not transferring small, junk files.  See the --max-size option for a  description of SIZE and other info.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--mkpath",
      "value_type": "Bool",
      "takes_value": false,
      "description": "create destination's missing path components",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--modify-window",
      "value_type": "File",
      "takes_value": true,
      "description": "comparing  two  timestamps, rsync treats the timestamps as being equal if they differ by no  more  than  the  modify-window value.   The  default  is 0, which matches just integer seconds. If you specify a negative value (and the receiver  is  at  least version 3.1.3) then nanoseconds will also be taken into account. Specifying  1  is  useful  for  copies  to/from  MS  Windows FAT filesystems, because FAT represents times with a 2-second  reso‐ lution  (allowing  times  to differ from the original by up to 1 second).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--munge-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  affects  just  one  side of the transfer and tells rsync to munge symlink values when it is receiving files or  un‐ munge  symlink values when it is sending files.  The munged val‐ ues make the symlinks unusable on disk but allows  the  original contents of the symlinks to be recovered.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-OPTION",
      "value_type": "Bool",
      "takes_value": false,
      "description": "may  turn  off one or more implied options by prefixing the option name with \"no-\".  Not all positive options have a negated opposite, but a lot do, including those that can be used to dis‐ able an implied option (e.g.  --no-D, --no-perms) or  have  dif‐ ferent  defaults in various circumstances (e.g. --no-whole-file,",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-R",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-blocking-io",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Every valid  negated  option  ac‐ cepts  both  the  short and the long option name after the \"no-\" prefix (e.g. --no-R is the same as --no-relative).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-implied-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "--relative  op‐ tion.   When  it is specified, the attributes of the implied di‐ rectories from the source names are not included in  the  trans‐ fer.   This  means  that  the corresponding path elements on the destination system are left unchanged if  they  exist,  and  any missing implied directories are created with default attributes. This even allows these implied path elements to have big differ‐ ences,  such  as being a symlink to a directory on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-inc-recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This makes rsync scan the full file list before it begins to transfer files.  See --inc-recursive for more info.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-motd",
      "value_type": "String",
      "takes_value": true,
      "description": "This suppresses the message- of-the-day  (MOTD) text, but it also affects the list of modules that the daemon sends in response to the \"rsync host::\"  request (due to a limitation in the rsync protocol), so omit this option if you want to request the list of modules from the daemon.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-secluded-args",
      "value_type": "String",
      "takes_value": true,
      "description": "This environment variable is also superseded by a non-zero RSYNC_OLD_ARGS export.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--no-whole-file",
      "value_type": "Bool",
      "takes_value": false,
      "description": "whole-file updating when it is enabled by default for a local transfer.  This usually slows rsync down, but  it  can  be useful  if you are trying to minimize the writes to the destina‐ tion file (if combined with --inplace) or for testing the check‐ sum-based update algorithm.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--numeric-ids",
      "value_type": "Bool",
      "takes_value": false,
      "description": "this option rsync will transfer numeric group and user IDs rather than using user and group names and mapping them at  both ends.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--old-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "disable the modern arg-protection idiom",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--old-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "works like --dirs when talking to old rsync",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-O",
      "long": "--omit-dir-times",
      "value_type": "Directory",
      "takes_value": true,
      "description": "access,  and create times.  If NFS is sharing the di‐ rectories on the receiving side, it is a good idea  to  use  -O. This  option  is  inferred if you use --backup without --backup- dir.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-J",
      "long": "--omit-link-times",
      "value_type": "Bool",
      "takes_value": false,
      "description": "modifi‐ cation, access, and create times.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-x",
      "long": "--one-file-system",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync  to avoid crossing a filesystem boundary when recursing.  This does not limit the user's  ability  to  specify items  to copy from multiple filesystems, just rsync's recursion through the hierarchy of each directory that the user specified, and also the analogous recursion on the  receiving  side  during deletion.  Also keep in mind that rsync treats a \"bind\" mount to the same device as being on the same filesystem.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--only-write-batch",
      "value_type": "String",
      "takes_value": true,
      "description": "system  when  creating  the  batch.   This lets you transport the changes to the destination system via  some  other means and then apply the changes via --read-batch.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--open-noatime",
      "value_type": "Bool",
      "takes_value": false,
      "description": "avoid changing the atime on opened files",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--out-format",
      "value_type": "File",
      "takes_value": true,
      "description": "The format is a text  string containing  embedded  single-character escape sequences prefixed with a percent (%) character.  A default format of \"%n%L\" is as‐ sumed if either --info=name or -v is specified (this  tells  you just  the  name of the file and, if the item is a link, where it points).  For a full list of the possible escape characters, see the log format setting in the rsyncd.conf manpage.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--outbuf",
      "value_type": "String",
      "takes_value": true,
      "description": "The mode can be None  (aka Unbuffered), Line, or Block (aka Full).  You may specify as lit‐ tle  as  a  single  letter  for the mode, and use upper or lower case.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--owner",
      "value_type": "Bool",
      "takes_value": false,
      "description": "(-o),  instead  of  converting -a into -rlptgD, you can specify -a --no-o (aka --archive --no-owner).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--partial",
      "value_type": "Bool",
      "takes_value": false,
      "description": "default, rsync will delete any partially transferred file if the transfer is interrupted.  In some circumstances it  is  more desirable to keep partially transferred files.  Using the --par‐ tial  option  tells  rsync to keep the partial file which should make a subsequent transfer of the rest of the file much faster.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--partial-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "while also  implying  that  it be enabled.  This enhanced partial-file method puts any partially transferred files into  the  specified DIR  instead  of writing the partial file out to the destination file.  On the next transfer, rsync will use a file found in this dir as data to speed up the resumption of the transfer and  then delete it after it has served its purpose.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--password-file",
      "value_type": "File",
      "takes_value": true,
      "description": "for  accessing  an rsync daemon via a file or via standard input if FILE is -.  The file  should  contain  just  the password on the first line (all other lines are ignored).  Rsync will exit with an error if FILE is world readable or if a root-run rsync command  finds  a  non- root-owned file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": "--perms",
      "value_type": "Bool",
      "takes_value": false,
      "description": "set  the  destination permissions  to be the same as the source permissions. (See also the --chmod option for a way to modify what rsync  considers  to be the source permissions.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--port",
      "value_type": "Url",
      "takes_value": true,
      "description": "specifies  an alternate TCP port number to use rather than the default of 873.  This is only needed if you  are  using  the double-colon  (::) syntax to connect with an rsync daemon (since the URL syntax has a way to specify the port as a  part  of  the URL).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--preallocate",
      "value_type": "Bool",
      "takes_value": false,
      "description": "size before writing data to the file.  Rsync will only use the real filesystem-level preallocation support provided  by Linux's fallocate(2) system call or Cygwin's posix_fallocate(3), not  the  slow glibc implementation that writes a null byte into each block.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--progress",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  tells  rsync  to  print  information  showing  the progress of the transfer.  This gives a bored user something  to watch.   With  a  modern  rsync  this  is the same as specifying",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--protocol",
      "value_type": "File",
      "takes_value": true,
      "description": "an older protocol version to be used.  This is useful for creating a batch file that is compatible with an  older  version of  rsync.   For instance, if rsync 2.6.4 is being used with the",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-m",
      "long": "--prune-empty-dirs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "from  the  file-list,  including nested directories that have no non-directory children.  This is useful for avoiding the creation of a bunch of  useless  directories  when  the  sending rsync  is  recursively  scanning  a hierarchy of files using in‐ clude/exclude/filter rules.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-q",
      "long": "--quiet",
      "value_type": "Bool",
      "takes_value": false,
      "description": "you  are  given during  the  transfer,  notably suppressing information messages from the remote server.  This option  is  useful  when  invoking rsync from cron.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--read-batch",
      "value_type": "File",
      "takes_value": true,
      "description": "gen‐ erated  by  --write-batch.  If FILE is -, the batch data will be read from standard input. See the \"BATCH MODE\" section  for  de‐ tails.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": "--recursive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "copy  directories  recursively.   See  also",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-R",
      "long": "--relative",
      "value_type": "Bool",
      "takes_value": false,
      "description": "relative paths.  This means that the full path names speci‐ fied on the command line are sent to the server rather than just the last parts of the filenames.  This  is  particularly  useful when  you want to send several different directories at the same time.  For example, if you used this command:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-M",
      "long": "--remote-option",
      "value_type": "File",
      "takes_value": true,
      "description": "option is used for more advanced situations where you want certain effects to be limited to one side of the transfer  only. For instance, if you want to pass --log-file=FILE and --fake-su‐ per to the remote system, specify it like this:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--remove-source-files",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync  to  remove  from  the sending side the files (meaning non-directories) that are a part of  the  transfer  and have been successfully duplicated on the receiving side.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-e",
      "long": "--rsh",
      "value_type": "String",
      "takes_value": true,
      "description": "an  alternative  remote  shell program  to  use  for communication between the local and remote copies of rsync.  Typically, rsync is configured to use  ssh  by default, but you may prefer to use rsh on a local network.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--rsync-path",
      "value_type": "File",
      "takes_value": true,
      "description": "this to specify what program is to be run on the remote ma‐ chine to start-up rsync.  Often used when rsync is  not  in  the default    remote-shell's   path   (e.g.   --rsync-path=/usr/lo‐ cal/bin/rsync).  Note that PROGRAM is run with  the  help  of  a shell,  so  it  can  be any program, script, or command sequence you'd care to run, so long as it does not corrupt the  standard- in & standard-out that rsync is using to communicate.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--safe-links",
      "value_type": "Bool",
      "takes_value": false,
      "description": "links  in the  transfer which point outside the copied tree.  All absolute symlinks are also ignored.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": "--secluded-args",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  sends all filenames and most options to the remote rsync via the protocol (not the remote shell command line) which avoids letting the remote shell modify them.  Wildcards are  ex‐ panded on the remote host by rsync instead of a shell.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--size-only",
      "value_type": "Bool",
      "takes_value": false,
      "description": "modifies rsync's \"quick check\" algorithm for finding files that need to be transferred, changing it  from  the  default  of transferring files with either a changed size or a changed last- modified  time  to  just  looking for files that have changed in size.  This is useful when starting to use rsync after using an‐ other mirroring system which may  not  preserve  timestamps  ex‐ actly.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--skip-compress",
      "value_type": "String",
      "takes_value": true,
      "description": "skip compressing files with suffix in LIST",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sockopts",
      "value_type": "Directory",
      "takes_value": true,
      "description": "option can provide endless fun for people who like to tune their systems to the utmost degree.  You can set  all  sorts  of socket  options  which  may  make transfers faster (or slower!). Read the manpage for the setsockopt() system call for details on some of the options you may be able to set.  By default no  spe‐ cial  socket  options  are set.  This only affects direct socket connections to a remote rsync daemon.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-S",
      "long": "--sparse",
      "value_type": "Bool",
      "takes_value": false,
      "description": "to  handle  sparse  files  efficiently so they take up less space on the destination.  If combined with --inplace  the  file created  might  not end up with sparse blocks with some combina‐ tions of kernel version and/or filesystem type.  If --whole-file is in effect (e.g. for a local copy) then it  will  always  work because  rsync  truncates  the file prior to writing out the up‐ dated version.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--specials",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  causes  rsync  to  transfer special files, such as named sockets and fifos.  If the receiving rsync  is  not  being run as the super-user, rsync silently skips creating the special files (see also the --super and --fake-super options).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stats",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync  to  print a verbose set of statistics on the file transfer, allowing you to tell how effective rsync's delta- transfer algorithm is for your data.  This option is  equivalent to  --info=stats2  if  combined  with  0  or  1  -v  options, or",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stderr",
      "value_type": "String",
      "takes_value": true,
      "description": "change stderr output mode (default: errors)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stop-after",
      "value_type": "Number",
      "takes_value": true,
      "description": "option tells rsync to stop copying when the specified num‐ ber of minutes has elapsed.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--stop-at",
      "value_type": "Number",
      "takes_value": true,
      "description": "a  numeric  format   of   year-month-dayThour:minute   (e.g. 2000-12-31T23:59) in the local timezone.  You may choose to sep‐ arate the date numbers using slashes instead of dashes.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--suffix",
      "value_type": "Directory",
      "takes_value": true,
      "description": "option  allows  you  to override the default backup suffix used with the --backup (-b) option.  The default suffix is  a  ~ if  no  --backup-dir  was  specified,  otherwise  it is an empty string.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--super",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  the receiving side to attempt super-user activities even if the receiving rsync wasn't run by the super-user.  These activities include: preserving users  via  the  --owner  option, preserving  all  groups (not just the current user's groups) via the --group option, and copying devices via  the  --devices  op‐ tion.   This  is  useful  for systems that allow such activities without being the super-user, and also  for  ensuring  that  you will get errors if the receiving side isn't being run as the su‐ per-user.  To turn off super-user activities, the super-user can use --no-super.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-T",
      "long": "--temp-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "a  scratch  directory when  creating  temporary copies of the files transferred on the receiving side.  The default behavior is to create  each  tempo‐ rary  file  in  the same directory as the associated destination file.  Beginning with rsync 3.1.1, the  temp-file  names  inside the specified DIR will not be prefixed with an extra dot (though they will still have a random suffix added).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--timeout",
      "value_type": "String",
      "takes_value": true,
      "description": "seconds. If no data is transferred for the specified time then rsync will exit.  The default is 0, which means no timeout.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": "--times",
      "value_type": "Bool",
      "takes_value": false,
      "description": "with  the files  and  update them on the remote system.  Note that if this option is not used, the optimization that  excludes  files  that have  not  been  modified cannot be effective; in other words, a missing -t (or -a) will cause the next transfer to behave as  if it  used  --ignore-times  (-I),  causing all files to be updated (though rsync's delta-transfer algorithm will  make  the  update fairly  efficient  if the files haven't actually changed, you're much better off using -t).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--trust-sender",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  disables  two extra validation checks that a local client performs on the file list generated by a  remote  sender. This  option  should only be used if you trust the sender to not put something malicious in the file list (something  that  could possibly be done via a modified rsync, a modified shell, or some other similar manipulation).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-u",
      "long": "--update",
      "value_type": "Bool",
      "takes_value": false,
      "description": "destina‐ tion  and  have  a  modified  time that is newer than the source file. (If an existing destination file has a  modification  time equal  to the source file's, it will be updated if the sizes are different.)",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--usermap",
      "value_type": "Number",
      "takes_value": true,
      "description": "should be  mapped to other values by the receiving side.  The STRING is one or more FROM:TO pairs of values separated  by  commas.   Any matching  FROM value from the sender is replaced with a TO value from the receiver.  You may specify usernames or  user  IDs  for the  FROM  and TO values, and the FROM value may also be a wild- card string, which will be matched against  the  sender's  names (wild-cards  do  NOT  match against ID numbers, though see below for why a '*' matches everything).  You may  instead  specify  a range of ID numbers via an inclusive range: LOW-HIGH.  For exam‐ ple:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": "--verbose",
      "value_type": "Bool",
      "takes_value": false,
      "description": "you  are  given during  the transfer.  By default, rsync works silently.  A sin‐ gle -v will give you information  about  what  files  are  being transferred and a brief summary at the end.  Two -v options will give  you  information  on  what  files  are  being  skipped and slightly more information at the end.  More than two -v  options should only be used if you are debugging rsync.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-V",
      "long": "--version",
      "value_type": "String",
      "takes_value": true,
      "description": "info  and  exit.   When  re‐ peated, the information is output is a JSON format that is still fairly readable (client side only).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-W",
      "long": "--whole-file",
      "value_type": "Bool",
      "takes_value": false,
      "description": "option  disables  rsync's  delta-transfer algorithm, which causes all transferred files to be sent whole.  The transfer may be faster if this option is used when the bandwidth between  the source  and destination machines is higher than the bandwidth to disk  (especially  when  the  \"disk\"  is  actually  a  networked filesystem).   This is the default when both the source and des‐ tination are specified as local paths, but  only  if  no  batch- writing option is in effect.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--write-batch",
      "value_type": "File",
      "takes_value": true,
      "description": "a  file  that  can later be applied to another identical destination with --read-batch.  See the \"BATCH MODE\" section for details, and also the --only-write-batch option.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--write-devices",
      "value_type": "Bool",
      "takes_value": false,
      "description": "tells  rsync  to treat a device on the receiving side as a regular file, allowing the writing of file data into a device.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-X",
      "long": "--xattrs",
      "value_type": "Bool",
      "takes_value": false,
      "description": "at‐ tributes to be the same as the source ones.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-8",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "unescaped  in the  output  instead  of  trying  to test them to see if they're valid in the current locale and escaping the invalid ones.   All control  characters (but never tabs) are always escaped, regard‐ less of this option's setting.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-D",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "The -D option is equivalent to \"--devices --specials\".",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-F",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "The  -F  option  is a shorthand for adding two --filter rules to your command.  The first time it is used is a shorthand for this rule:",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "The -P option is equivalent to \"--partial --progress\".  Its pur‐ pose  is to make it much easier to specify these two options for a long transfer that may be interrupted.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-f",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [
    {
      "name": "--no-old-args",
      "description": "--se‐ cluded-args is specified on the command line.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "--no-secluded-args",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "batch",
      "description": "option is used: it will be named the same as the batch file with \".sh\" appended. This script file contains a command-line suitable for",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "by",
      "description": "default. When this environment variable is set to a non-zero value, it supersedes the RSYNC_PROTECT_ARGS variable.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "checksum",
      "description": null,
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "due",
      "description": "to a transfer rule, the receiving side does not request the file.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "empty-dirs",
      "description": "option will not judge a directory as being empty even if it contains only files that the transfer rules omitted.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "executed",
      "description": "using a Bourne (or Bourne-like) shell, optionally passing in",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "get",
      "description": "deleted on the receiving side. For example, if the file \"foo\" is",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "not",
      "description": "remove a matching file named \"foo\" on the receiving side. On the",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "o",
      "description": "an option was specified that is supported by the client and not by the server",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "ple",
      "description": "destination trees. Multicast transport protocols can be used to",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "script",
      "description": "named rrsync (for restricted rsync) that can be used with a re‐ stricted ssh login.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "set",
      "description": "If both are set, USER takes precedence.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "shell",
      "description": "in combination with a daemon connection. This allows a script such as rsync-ssl to be able to know the port number that the user specified on the command line.",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "should",
      "description": "never be typed by a user under normal circumstances. Some",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "stance",
      "description": "example",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "such",
      "description": "as",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "the",
      "description": "--prune-",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "this",
      "description": "using batch mode, rsync is run with the write-batch option to ap‐",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    },
    {
      "name": "when",
      "description": "setting up a login that can only run an rsync command. For in‐",
      "flags": [],
      "positional": [],
      "subcommands": [],
      "aliases": []
    }
  ],
  "positional": [
    {
      "name": "and",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "cross-linking",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "dest",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    },
    {
      "name": "files",
      "value_type": "File",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "includes",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "just",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "list",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "manpage",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "no",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "of",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "one",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "online",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "source",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "src",
      "value_type": "String",
      "required": true,
      "multiple": true,
      "description": null
    },
    {
      "name": "that",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "the",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "this",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "version",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "will",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "with",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 1.0,
  "version": "3.2.7"
}