{
  "schema_version": "1.0.0",
  "command": "ucf",
  "description": "ucf - Update Configuration File: preserve user changes in configuration files",
  "global_flags": [
    {
      "short": null,
      "long": "--debconf-ok",
      "value_type": "Bool",
      "takes_value": false,
      "description": "that  it is ok for ucf to use an already running debconf instance for prompting (it has always been ok to use ucf when deb‐ conf is not running -- it shall invoke debconf as needed).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--debconf-template",
      "value_type": "Bool",
      "takes_value": false,
      "description": "foo Instruct ucf to use the named multiselect debconf template instead of the normal ucf-provided debconf template.  The  caller  is  re‐ sponsible  for  ensuring  that  the  named template exists and has a list of choices matching those for the default ucf template, and should set Choices-C: ${CHOICES} to ensure the returned values match those from the default template.  Note that the choices must  be different according to whether the --three-way option is also set.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": "--debug",
      "value_type": "String",
      "takes_value": true,
      "description": "the  optional  digit  n. This turns on copious debugging information.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-h",
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": "--no-action",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": "--package",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Don't follow dpkg-divert diversions by package foo.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": "--purge",
      "value_type": "Bool",
      "takes_value": false,
      "description": "all  vestiges of the file from the state hashfile. This is required to allow a package to be reinstalled after it is purged; since otherwise, the real configuration file is removed, but it remains in the hash file; and on reinstall no action is taken,  since the md5sum of the new file matches that in the hashfile.  In short, remember to use this option in the postrm for every configuration file  managed  by  ucf  when the package is being purged (assuming ucf itself exists).  Note: ucf does not actually touch the file on disk in this operation, so any file removals are still the responsibility of the calling package.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": "--src-dir",
      "value_type": "File",
      "takes_value": true,
      "description": "foo Set the source directory (historical md5sums are expected to live in files and sub directories of this directory) to foo. By default, the directory the new_file lives in is assumed to be the source directory. Setting this option overrides settings in the  environment variable UCF_SOURCE_DIR, and in the  configuration  file variable conf_source_dir.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--state-dir",
      "value_type": "Bool",
      "takes_value": false,
      "description": "Used mostly for testing.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--sum-file",
      "value_type": "File",
      "takes_value": true,
      "description": "foo Force  the  historical md5sums to be read from this file, rather than defaulting to living in the source directory.  Setting this op‐ tion overrides settings in the environment variable UCF_OLD_MDSUM_FILE, and in the  configuration  file variable conf_old_mdsum_file.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--three-way",
      "value_type": "Bool",
      "takes_value": false,
      "description": "between  old  main‐ tainer  version  and  the new maintainer version into the local copy of the configuration file. If the user likes what they see, they can ask to have these changes merged in. This allows one to get new upstream changes merged in even while retaining  local  modifica‐ tions  to the configuration file. This is accomplished by taking the configuration file and stashing it in a cache area during regis‐ tration, and using diff3 during the install (the stashed file name is a munged version of the full path of the configuration file  to avoid name space clashes).",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-v",
      "long": "--verbose",
      "value_type": "Bool",
      "takes_value": false,
      "description": null,
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-Z",
      "long": null,
      "value_type": "Bool",
      "takes_value": false,
      "description": "Set SELinux security context of destination file to default type.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [],
  "positional": [
    {
      "name": "destination",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    },
    {
      "name": "new",
      "value_type": "String",
      "required": true,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 0.9,
  "version": null
}