{
  "schema_version": "1.0.0",
  "command": "xargs",
  "description": "xargs - build and execute command lines from standard input",
  "global_flags": [
    {
      "short": "-a",
      "long": "--arg-file",
      "value_type": "Directory",
      "takes_value": true,
      "description": "If you use this option, stdin remains unchanged when commands  are  run.   Otherwise, stdin is redirected from /dev/null.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-d",
      "long": "--delimiter",
      "value_type": "File",
      "takes_value": true,
      "description": "items are terminated by the specified character.  The specified delimiter may be a single character, a C-style character escape such as \\n, or an octal or hexadecimal escape code.  Octal and hexadecimal escape codes are understood  as  for  the  printf  command. Multibyte characters are not supported.  When processing the input, quotes and backslash are not special; every character in the input is taken literally.  The -d option disables any end-of-file string, which is treated like any other argument.  You can use this option when  the  input  consists of simply newline-separated items, although it is almost always better to design your program to use --null where this is possible.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-e",
      "long": "--eof",
      "value_type": "File",
      "takes_value": true,
      "description": "option  is  a synonym for the -E option.  Use -E instead, because it is POSIX compliant while this option is not.  If eof-str is omitted, there is no end of file string.  If neither -E nor -e is used, no end of file string is used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-x",
      "long": "--exit",
      "value_type": "Bool",
      "takes_value": false,
      "description": "exit if the size (see -s) is exceeded",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--help",
      "value_type": "Bool",
      "takes_value": false,
      "description": "display this help and exit",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-p",
      "long": "--interactive",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  user about whether to run each command line and read a line from the terminal.  Only run the command line if the response starts with `y' or `Y'.  Implies -t.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-n",
      "long": "--max-args",
      "value_type": "String",
      "takes_value": true,
      "description": "at  most  max-args arguments per command line.  Fewer than max-args arguments will be used if the size (see the -s option) is ex‐ ceeded, unless the -x option is given, in which case xargs will exit.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-s",
      "long": "--max-chars",
      "value_type": "String",
      "takes_value": true,
      "description": "at  most max-chars characters per command line, including the command and initial-arguments and the terminating nulls at the ends of the argument strings.  The largest allowed value is system-dependent, and is calculated as the argument length limit for exec, less the size of your environment, less 2048 bytes of headroom.  If this value is more than 128KiB, 128Kib is used as  the  default  value; otherwise, the default value is the maximum.  1KiB is 1024 bytes.  xargs automatically adapts to tighter constraints.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-L",
      "long": "--max-lines",
      "value_type": "String",
      "takes_value": true,
      "description": "Trailing blanks cause an input line to be  logically  continued  on  the next input line.  Implies -x.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-P",
      "long": "--max-procs",
      "value_type": "Number",
      "takes_value": true,
      "description": "If max-procs is 0, xargs will run as many processes as possible at a time. Use the -n option or the -L option with -P; otherwise chances are that only one exec will be done.  While xargs is  running,  you  can send  its process a SIGUSR1 signal to increase the number of commands to run simultaneously, or a SIGUSR2 to decrease the number.  You cannot increase it above an implementation-defined limit (which is shown with --show-limits).  You cannot decrease it below 1.   xargs never terminates its commands; when asked to decrease, it merely waits for more than one existing command to terminate before starting another.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-r",
      "long": "--no-run-if-empty",
      "value_type": "String",
      "takes_value": true,
      "description": "Normally, the command is run once even if there  is  no input.  This option is a GNU extension.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-0",
      "long": "--null",
      "value_type": "File",
      "takes_value": true,
      "description": "taken  literally).  Disables the end of file string, which is treated like any other argument.  Useful when input items might con‐ tain white space, quote marks, or backslashes.  The GNU find -print0 option produces input suitable for this mode.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-o",
      "long": "--open-tty",
      "value_type": "Bool",
      "takes_value": false,
      "description": "This is useful if you want xargs to  run  an  interactive application.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--process-slot-var",
      "value_type": "String",
      "takes_value": true,
      "description": "Values are reused once child processes exit.  This can be used in a rudimentary load distribution scheme, for example.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-i",
      "long": "--replace",
      "value_type": "String",
      "takes_value": true,
      "description": "option  is  a  synonym for -Ireplace-str if replace-str is specified.  If the replace-str argument is missing, the effect is the same as -I{}.  This option is deprecated; use -I instead.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--show-limits",
      "value_type": "Bool",
      "takes_value": false,
      "description": "the  limits on the command-line length which are imposed by the operating system, xargs' choice of buffer size and the -s op‐ tion.  Pipe the input from /dev/null (and perhaps specify --no-run-if-empty) if you don't want xargs to do anything.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-t",
      "long": "--verbose",
      "value_type": "Bool",
      "takes_value": false,
      "description": "print commands before executing them",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": null,
      "long": "--version",
      "value_type": "Bool",
      "takes_value": false,
      "description": "output version information and exit",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-E",
      "long": null,
      "value_type": "File",
      "takes_value": true,
      "description": "If the end of file string occurs as a line of input, the rest of the  input  is  ignored.   If neither -E nor -e is used, no end of file string is used.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    },
    {
      "short": "-I",
      "long": null,
      "value_type": "String",
      "takes_value": true,
      "description": "Also, unquoted blanks do not  termi‐ nate input items; instead the separator is the newline character.  Implies -x and -L 1.",
      "multiple": false,
      "conflicts_with": [],
      "requires": []
    }
  ],
  "subcommands": [],
  "positional": [
    {
      "name": "initial-arguments",
      "value_type": "String",
      "required": false,
      "multiple": false,
      "description": null
    }
  ],
  "source": "Merged",
  "confidence": 0.9,
  "version": null
}